[
  {
    "uid": "morning-dispatch-2026-02-22",
    "updateDate": "2026-02-22T13:01:52.168Z",
    "titleText": "The Dispatch - Morning Briefing",
    "mainText": "**Title: Supreme Court Rules Against Trump’s Tariffs**\n\nOn Friday, the Supreme Court emerged from its winter recess to deliver a significant ruling regarding former President Donald Trump’s discretion to impose tariffs under the International Emergency Economic Powers Act of 1977 (IEEPA). In a 6-3 decision authored by Chief Justice John Roberts, the Court determined that Trump lacked authority for the sweeping tariffs he enacted. Joining Roberts were conservative justices Amy Coney Barrett, Neil Gorsuch, and the three liberal justices: Elena Kagan, Sonia Sotomayor, and Ketanji Brown Jackson. The ruling spanned 170 pages, which included a dissent from Justice Brett Kavanaugh and several concurring opinions. As reported by SCOTUSblog’s Amy Howe, in an opinion joined by Justices Gorsuch and Barrett, Roberts noted that Trump’s reliance on IEEPA violated the Constitution’s ‘major questions’ doctrine. This principle maintains that Congress must explicitly delegate power to make significant economic or political decisions.\n\nBusinesses relying on imported goods expressed relief at the ruling. However, uncertainty remains as the Court did not address whether tariffs would be refunded to those who paid them, leaving the door open for Trump to pursue similar tariffs under different legislative frameworks.\n\n**Impact on Small Businesses**\n\nIn a piece published just prior to the ruling, journalist John McCormack interviewed Beth Benike, owner of Busy Baby, a small business selling products designed to keep toddlers entertained during meals. She faced potential tariffs amounting to $230,000 on a shipment valued at $160,000 due to Trump’s “Liberation Day” tariffs implemented on April 2, 2025. Unable to absorb that cost, Benike’s product remained in China for two months, leading to a loss of revenue estimated at half a million dollars, which resulted in significant cutbacks and financial distress for her business.\n\n**Tariff Costs to Consumers**\n\nRecent reports illustrate the broader economic effects of Trump’s trade policies. The nonpartisan Tax Foundation reported that American households faced approximately $1,000 in additional expenses this year due to tariffs. A study released by the Federal Reserve Bank of New York indicated that the financial burden of these tariffs fell primarily on American consumers, contradicting claims made by Trump about who ultimately pays these tariffs. For instance, it was noted that Americans pay $94 from every $100 collected in tariff revenue, without recognizing the secondary economic effects on spending power.\n\n**Claims of Foreign Investment**\n\nTrump has repeatedly asserted that his tariff threats led to $18 trillion in foreign investment commitments. However, Scott Lincicome critically evaluated this claim, citing that the White House acknowledges a figure of only $9.6 trillion related to the so-called “Trump Effect” and emphasizes that much of this investment would not materialize as promised.\n\nIn summary, the Supreme Court’s decision not only limits executive power regarding tariff implementation but also reflects the ongoing strain tariffs have placed on small businesses and the American consumer.\n\n**Additional Reading: Best of the Rest**\n1. **The Iran Disaster** - A civic and political calamity in the making. By Nick Catoggio.\n2. **Trump Accounts, Not Baby Bonuses** - An analysis of mixed results for family policy advocates from Trump’s second administration. By Charles Hilu.\n3. **Finding the Good Life in an Age of Designer Babies and High Achievers** - Exploring the nuanced conversations surrounding contemporary parenting ethics. By Michael Reneau and Amy Julia Becker.",
    "redirectionUrl": "https://thedispatch.com"
  }
]