[
  {
    "uid": "morning-dispatch-2026-01-24",
    "updateDate": "2026-01-24T13:01:10.526Z",
    "titleText": "The Dispatch - Morning Briefing",
    "mainText": "**Old Color for a Gray New World**\n**January 24, 2026**\n**Contributors:** Valerie Pavilonis, Mark Oppenheimer, James Scimecca\n\n**Book Review: The Haunted Fiction of George Saunders**\nThis week, we highlight a review of American writer George Saunders' latest book. As writer Nadya Williams notes, Saunders reflects on our materialistic age, discussing in a 2016 interview: \"Modernity keeps trying to reject anything that science cannot prove. But the world we see is not all there is.\"\n\n**Pop-Punk Renaissance**\nJames Scimecca, our audience engagement editor, explores what he describes as the pop-punk renaissance of 2025. He states that the genre remains popular among those under forty, successfully evading the label of 'dad rock.' \"While it may be soul-crushing to think about that merciless march of time, pop-punk has continued to dominate youth culture,\" Scimecca writes.\n\n**Earlier Highlights**\nFrom earlier this week, we have Kevin D. Williamson discussing Martin Luther King, Jr. and civil disobedience, alongside a *Remnant* episode focused on crime in 1980s New York City. Additionally, historian Susan Dichter reflects on the birth of the American hotel and its influence on national behavior.\n\n**An Examination of Depression Glass**\nMark Oppenheimer shares a personal account connecting him to depression glass. He recalls how his grandfather served root beer floats in a distinctive mottled green and translucent glass, which was both practical and collectible. Oppenheimer notes that depression glass items were produced from 1929 to 1939 by various companies, often distributed through promotional offers. The trend for this vintage dishware, even including uranium glass which glows under UV light, has surged in popularity in recent years. \"Depression glass deserves this renaissance in our increasingly bland world,\" Oppenheimer asserts, emphasizing the need for color in our environments.\n\n**A Memorandum of the Beverly Hills Hotel**\nIn a nostalgic dispatch from 1993, Adam Gopnik portrays the once-thriving Beverly Hills Hotel, focusing on Irving, an 87-year-old denizen of its poolside. Gopnik describes Irving's impeccable style, noting he is the \"best-dressed eighty-seven-year-old in America\" with exquisite taste in clothing. The passage paints a vivid picture of past glamour and personal interactions, reflecting a bygone era.\n\n**Music Reviews: Mayday Parade’s Emo Discography**\nIn a bonus from James Scimecca's emo review, he discusses Mayday Parade's anticipated triple album, with parts one and two set to release in late spring. The first album, *Sweet*, features catchy songs like \"By the Way,\" while the second album, *Sad*, is described as quintessentially Mayday, full of emotional depth and modern storytelling. Scimecca notes the albums are perfect for nostalgic drives with the windows down.\n\n**Artwork Highlight: Landscape with the Fall of Icarus**\nThe work of the week is an artwork attributed to Pieter Bruegel the Elder, titled *Landscape with the Fall of Icarus*, dating back to around 1560. John Ford expressed admiration for this piece, explaining its relevance to the vanity trap depicted in both art and poetry.",
    "redirectionUrl": "https://thedispatch.com"
  }
]