[
  {
    "uid": "morning-dispatch-2026-01-26",
    "updateDate": "2026-01-26T13:00:17.045Z",
    "titleText": "The Dispatch - Morning Briefing",
    "mainText": "**Border Patrol Agents Kill Minneapolis Protester**\nU.S. Border Patrol agents on Saturday shot and killed 37-year-old Alex Pretti during a confrontation with protesters in Minneapolis. Homeland Security Secretary Kristi Noem stated Pretti was armed with \"weapons and ammunition\" and interfered with a law enforcement operation, labeling him as a \"domestic terrorist.\" The Department of Homeland Security (DHS) alleged that agents attempted to disarm Pretti, who reportedly resisted violently.  Video footage shows an agent removing a handgun from Pretti's waistband seconds before another agent opened fire. No evidence has emerged that Pretti, who held a concealed carry permit and previously worked as an ICU nurse, assaulted the agents. His family condemned the government’s narrative as \"sickening lies,\" stating, \"Alex is clearly not holding a gun when attacked.\" Minnesota Governor Tim Walz echoed these sentiments, calling the DHS account \"lies\" and vowing to initiate a thorough state investigation.  A state judge issued a warrant to investigate the crime scene, but federal law enforcement did not recognize the order. A federal district judge later blocked the Trump administration from destroying or altering potential evidence related to the investigation.\n\n**Xi’s Military Leadership Purge**\nChina's Ministry of National Defense announced Saturday that Gen. Zhang Youxia, the nation's highest-ranking military officer after Xi Jinping, was placed under investigation for significant violations of discipline and law. Also under investigation is Liu Zhenli, chief of staff of the Central Military Commission (CMC) Joint Staff Department. As a vice-chairman of the commission, Zhang was viewed as Xi's trusted ally, with their families having fought together during the Chinese civil war. An internal military briefing reported accusations of Zhang leaking nuclear weapon information and granting promotions in exchange for bribes.  This announcement has led to the \"total annihilation of the high command,\" according to a former CIA analyst, leaving just one active uniformed officer on the commission following Xi's removal of five of six generals appointed in 2022. Of the remaining members, only Zhang Shengmin, the anti-corruption chief overseeing the purges, has combat experience. More than 50 senior military officers and defense industry executives have reportedly been investigated since summer 2023.\n\n**Israel Searches for Last Body in Gaza**\nOn Sunday, the Israel Defense Forces (IDF) initiated search operations to locate the body of the last remaining Israeli hostage, Master Sgt. Ran Gvili, who died defending a kibbutz during Hamas's terrorist attack on October 7, 2023. The IDF searched a cemetery in northern Gaza, acknowledging credible intelligence suggesting Gvili's remains may be interred there though leads exist for other locations. The search is expected to extend over several days. Israeli Prime Minister Benjamin Netanyahu’s office stated that upon completion of the mission, \"Israel will open the Rafah crossing\" into Egypt, although no specific timeline was given. The U.S. is significantly urging Israel to proceed with the opening of the crossing as part of the next phase of the U.S.-backed Israel-Hamas ceasefire.\n\n**Ukrainian Peace Talks Continue**\nU.S., Ukrainian, and Russian officials convened in Abu Dhabi on Friday to discuss a potential deal to conclude the ongoing war. Ukrainian President Volodymyr Zelensky described the trilateral meeting as \"constructive,\" expressing hope for a follow-up meeting soon. In Vilnius, Zelensky stated a U.S. security guarantee deal for Ukraine \"is 100 percent ready\" for signing.  Coordinations for the signing of the proposal are underway, leading to legislative approvals in both nations. Russian forces conducted air strikes on Kyiv overnight, targeting energy infrastructure; over 1,300 properties in Kyiv are currently lacking heating.\n\n**Ted Cruz Caught on Tape**\nTexas Republican Sen. Ted Cruz was recorded privately criticizing President Donald Trump’s tariff policy and Vice President J.D. Vance in donor meetings last year. Cruz warned that the tariffs could damage the economy and result in impeachment. In a late-night call, Cruz advised Trump to reconsider, warning of a potential “bloodbath” in the upcoming midterms, to which Trump reportedly replied, \"F—k you, Ted.\" Cruz also derided",
    "redirectionUrl": "https://thedispatch.com"
  }
]