[
  {
    "uid": "morning-dispatch-2026-01-16",
    "updateDate": "2026-01-16T13:01:09.233Z",
    "titleText": "The Dispatch - Morning Briefing",
    "mainText": "**Why the Government (Probably) Won’t Shut Down**\n\nJust two months ago, Americans endured the longest government shutdown in the country’s history. For 43 days, hundreds of thousands of federal workers went without paychecks, SNAP food benefits were frozen for 42 million people, and thousands of Americans faced disruptions at airports amid widespread flight cancellations. Eventually, eight Senate Democrats broke from their caucus, voting for a bill to reopen the government without extending Affordable Care Act subsidies, a move that drew sharp criticism from within their party.\n\nThe bill signed into law by President Donald Trump set the next funding deadline for most of the government for January 30, just two weeks away. With the Senate out of session next week and the House the week after, lawmakers have only a week to finish passing the 12 annual appropriations bills, and they’re not quite done yet.\n\nHowever, there is growing optimism that the government will not shut down in two weeks. Congress is expected to pass at least eight of the twelve appropriations bills this month. If the remaining four miss their deadline, lawmakers will likely resort to a continuing resolution, or CR, which prevents shutdowns but freezes spending at current levels. Both parties typically express disdain for CRs, but they are preferable to shutdowns. Bipartisan cooperation has been evident recently, which reduces the likelihood of a shutdown occurring.\n\nThe last shutdown was a painful experience for all involved. Lawmakers and their constituents suffered, and the overall mood on Capitol Hill was tense. Senate Democratic Whip Dick Durbin conveyed hope in avoiding another shutdown, saying, \"I think that’s a painful exercise, and there are a lot of innocent victims.\"\n\nNegotiations have progressed since the last shutdown ended, including the passing of three appropriations bills funding the Department of Agriculture, Department of Veterans Affairs, and the legislative branch through September. This means that, regardless of future developments, SNAP funding is secure, and staff members for congressmen will continue receiving their pay.\n\nRecent bipartisan actions have resulted in the Senate approving a “minibus” of three appropriations bills for the Departments of Commerce, Justice, and the Interior, as well as the EPA, with a vote tally of 82 to 15. The House previously passed this package by a vote of 397 to 28, now awaiting Trump’s signature. With these bills approved, national parks would stay open even if the government were to shut down at the end of the month.\n\nSenator Patty Murray of Washington, the head Democrat on the Senate Appropriations Committee, underscored the importance of these bills in a Tuesday press conference, stating, “The programs that are funded in these bills are meaningful, and because Democrats were at the negotiating table, we were able to protect resources for programs that families rely on.”\n\nFurther, appropriators have introduced a pair of bipartisan bills to fund the State and Treasury Departments, along with federal courts and the White House. The House passed these bills on Wednesday with a vote of 341 to 79 and received praise from Senator Murray, indicating they are on track for presidential approval.\n\nDespite progress on these eight bills, key funding measures, especially for the Department of Defense and the Department of Transportation—which includes funding for air traffic control—have yet to pass. A shutdown could again delay payments to military members or disrupt air travel.\n\nThe most contentious piece of legislation appears to be for the Department of Homeland Security, which includes ICE funding. This process is essential for Democrats to extract concessions from Republicans, particularly in light of the recent shooting by an ICE officer, which has complicated negotiations.\n\nSenator Chris Murphy of Connecticut articulated the need for dialogue, asserting that Republicans must engage with Democrats' concerns in order to secure the necessary votes for a DHS bill. “Every single minute, we’re learning new ways that the department is acting lawlessly and ways that they are wasting taxpayer money,” he stated.\n\nAs lawmakers approach the funding deadline, they continue working towards an agreement, leaving only two weeks to finalize the necessary bills or decide how to proceed without agreement. The bro",
    "redirectionUrl": "https://thedispatch.com"
  }
]