[
  {
    "uid": "morning-dispatch-2026-03-01",
    "updateDate": "2026-03-01T13:01:59.034Z",
    "titleText": "The Dispatch - Morning Briefing",
    "mainText": "**Strikes on Iran and Reaction to the Tariff Ruling**\nThe United States and Israel launched a major strike on Iran overnight. President Donald Trump released a video statement labeling Iran the \"world's number one state sponsor of terror,\" and called on Iranians to \"take over your government.\" According to the Washington Post, military operations are expected to continue through the weekend. Iran has already retaliated by firing missiles and drones at Israel and attacking a U.S. naval base in Bahrain.\n\nThere will be much more discussion on this situation soon. For now, I’ll direct your attention to yesterday’s insightful Morning Dispatch titled, \"Is War With Iran Imminent?\" and contributing writer Mike Nelson’s recent piece on the justification Trump might present for targeting the regime, suggesting that such action would mark a significant shift from his administration's previous military strategies. Nelson noted that while previous efforts like Midnight Hammer aimed to dismantle military capabilities, the current campaign may focus on undermining the Iranian regime's resolve until they agree, in a verifiable manner, to dismantle their nuclear weapons program. This could involve a significant strike followed by a waiting period for Iran’s leadership to concede.\n\n**Supreme Court Ruling on Tariffs**\nIn other news, we observed reactions to the Supreme Court ruling from a week ago Friday, which determined that Trump exceeded his authority when imposing tariffs under the International Emergency Economic Powers Act. The Court concluded that Article I, Section 8 of the Constitution grants Congress exclusive power to levy taxes and tariffs.\n\nThe case was a consolidation of two similar lawsuits. Ilya Somin, co-counsel on a related case referred to as VOS Selections v. Trump, noted that the framers of the Constitution intended to prevent the president from replicating the tax abuses historically exercised by English kings.\n\nTrump's interpretation of the law suggested he possessed near unilateral authority over tariffs, akin to that of an absolute monarchy. The court decisively rejected this notion, with Chief Justice Roberts' majority opinion and concurring opinions from Justices Neil Gorsuch and Elena Kagan underscoring concerns related to unchecked presidential power. Gorsuch stated, \"Our system of separated powers and checks-and-balances threatens to give way to the continual and permanent accretion of power in the hands of one man. That is no recipe for a republic.\"\n\nMany critics, including Kevin D. Williamson, urged Congress to reclaim its authority regarding trade policy. There is growing skepticism amongst Republican lawmakers about their ability to take back the power they have long ceded to the executive branch.\n\nAfter the court's ruling, Trump initiated new tariffs citing Section 122 of the Trade Act of 1974. Initially set at 10%, he soon increased them to 15%. Despite the legal limitations placing these tariffs on a 150-day timeframe, there are expectations he may attempt to extend them through executive order.\n\nOn Capitol Hill, many lawmakers expressed a lack of enthusiasm for actively restructuring tariff legislation. GOP Representative Greg Murphy commented that the divisions within the House present challenges for nimble negotiations. Meanwhile, Representative Claudia Tenney expressed uncertainty regarding Congress’s ability to manage this situation. Charles Hilu pointed out that while this Congress is not the first to yield significant authority to the executive, there seems to be little appetite for reclaiming that authority. Overall, the likelihood of congressional action on tariffs in the coming months appears low.",
    "redirectionUrl": "https://thedispatch.com"
  }
]