[
  {
    "uid": "morning-dispatch-2026-02-13",
    "updateDate": "2026-02-13T13:02:47.617Z",
    "titleText": "The Dispatch - Morning Briefing",
    "mainText": "**Bangladesh Elects New Government**\nBangladeshi voters headed to the polls on Thursday for parliamentary elections, resulting in the center-right Bangladesh Nationalist Party (BNP) securing a supermajority with 213 seats out of 299 contested. The Islamist Jamaat party finished a distant second. Jamaat’s leader, Shafiqur Rahman, conceded defeat and expressed intentions to promote \"positive politics\" rather than opposing the BNP.\n\nU.S. Ambassador to Bangladesh Brent Christensen congratulated Tarique Rahman and the BNP, stating that the U.S. is eager to collaborate for shared goals of prosperity and security. Notably, this election marks Bangladesh's first free and fair electoral process since 2008.\n\n**Another U.S. Aircraft Carrier Arrives in the Middle East**\nReports indicate that the U.S. military is deploying a second aircraft carrier to the Middle East. The USS Gerald Ford, the most advanced carrier in the Navy, is being ordered to the region from the Caribbean. President Trump previously stationed another carrier, the USS Abraham Lincoln, in the region among several naval vessels. Israeli Prime Minister Benjamin Netanyahu mentioned an “excellent conversation” with Trump, who expressed optimism about negotiating effectively with Iran.\n\nIn related news, the Wall Street Journal reported that following an internet blackout imposed by Iran during protests, U.S. officials facilitated the shipment of approximately 6,000 Starlink terminals to allow internet access via SpaceX.\n\n**Homan Announces Minnesota Drawdown**\nTom Homan, White House border czar, announced the termination of the federal immigration surge enforcement operation in Minnesota. The drawdown began this week, with more federal authorities set to leave soon. A small number of enforcement officers will remain. Homan praised the initiative for its success in law enforcement, citing 4,000 arrests made by federal officials during the operation.\n\nDemocratic Governor Tim Walz remarked on the need for recovery, announcing a proposed measure for $10 million in forgivable loans for businesses affected by the operation. Minnesota Attorney General Keith Ellison called the end of the operation a victory, although he suggested it occurred later than ideal.\n\n**Olympics Disqualifies Ukrainian Athlete For Helmet**\nThe International Olympic Committee has disqualified Ukrainian skeleton racer Vladyslav Heraskevych from the Milan Olympic Games for planning to wear a helmet honoring Ukrainian athletes killed by Russian forces. The IOC stated this action was necessary to uphold the non-political nature of competition, although Heraskevych plans to appeal against the decision. In his defense, Ukrainian President Zelensky said the helmet symbolizes the cost of fighting for independence amid aggression from Russia.\n\n**Judge Temporarily Blocks DOD From Demoting Mark Kelly**\nAdditionally, a federal district judge granted a preliminary ruling halting the Department of Defense from demoting Arizona Senator Mark Kelly’s military rank while he contests the action. After several Democratic legislators, including Kelly, produced a video urging military personnel to resist unlawful orders, DOD's planned demotions were challenged. The judge ruled that Kelly is likely to succeed in arguing his First Amendment rights are being violated.\n\nThrough the course of other significant international developments, U.S. military actions continue to unfold amid evolving geopolitical dynamics, and domestic policies are addressed amid various challenges across states.",
    "redirectionUrl": "https://thedispatch.com"
  }
]