[
  {
    "uid": "morning-dispatch-2026-01-19",
    "updateDate": "2026-01-19T13:01:27.964Z",
    "titleText": "The Dispatch - Morning Briefing",
    "mainText": "**Will Trump Strike Iran?**\nThe Kremlin stated this morning that President Donald Trump has invited Vladimir Putin to join a \"Board of Peace\" overseeing Gaza. This choice raises eyebrows considering Putin's track record.\n\n**Quick Hits: Today’s Top Stories**\n**Trump Imposes Tariffs on Countries Supporting Greenland**\nPresident Donald Trump announced via a Truth Social post that he intends to impose a 10 percent tariff on eight European countries—Denmark, Finland, France, Germany, the Netherlands, Norway, Sweden, and the United Kingdom—for their deployment of a joint reconnaissance force to Greenland. The tariffs are set to take effect February 1 and will rise to 25 percent on June 1, remaining in place until a deal for the total purchase of Greenland is reached. The affected European leaders responded in a joint statement that such tariffs threaten transatlantic relations and could lead to a negative spiral.\n\n**International Reactions and Developments**\nReportedly, French President Emmanuel Macron will seek EU leaders' approval to activate the EU's anti-coercion instrument, created in 2023, to address trade restrictions against the U.S. This move could jeopardize the forthcoming U.S.-EU trade deal slated for July 2025.\nOn Friday, a bipartisan group of U.S. lawmakers met with Danish officials in Copenhagen, while Major General Soren Andersen, the commander of Denmark’s Joint Arctic Command, expressed concerns regarding potential Russian threats.\n\n**Trump Issues More Pardons**\nOn Thursday and Friday, Trump granted 14 pardons and eight commutations, including for former Puerto Rican Governor Wanda Vazquez Garced, who faces allegations of bribery. Notably, Venezuelan banker Julio Martin Herrera Velutini, who contributed $3.5 million to Trump's PAC, was pardoned, along with businesswoman Adriana Camberos, who was convicted of wire fraud.\n\n**More Details on the U.S. Campaign in Venezuela**\nU.S. authorities have maintained communication with Venezuelan Interior Minister Diosdado Cabello prior to the arrest of Nicolás Maduro during a recent operation. The DEA has identified Delcy Rodríguez, the acting Venezuelan leader, as a significant target due to her alleged involvement in money laundering schemes. Additionally, CIA Director John Ratcliffe conferred with Rodríguez recently to emphasize the need for Venezuela to combat drug trafficking.\nFollowing Maduro's capture, the Venezuelan government released more prisoners, including individuals from the Czech Republic, Germany, Hungary, and the Netherlands.\n\n**Ukraine Meetings in Florida**\nUkrainian officials engaged with White House special envoy Steve Witkoff and Jared Kushner over the weekend in Florida, discussing future security guarantees and reconstruction efforts post-war. In a separate discussion, Kyiv Mayor Vitali Klitschko noted that the city is currently receiving only half the necessary electricity amid ongoing Russian attacks on the power grid. Ukraine's President Volodymyr Zelensky described the country's defense systems as \"insufficient\" and lacking missiles.\n\n**Iran Blames Trump for Killings**\nIranian Supreme Leader Ali Khamenei attributed thousands of deaths in recent protests to U.S. interference during his speech on Saturday. He stated, \"We find the U.S. President guilty due to the casualties, damages, and slander he inflicted upon the Iranian nation.\" Following Trump's remarks praising Iran for halting executions of protesters, he commented on the need for new leadership in Iran.\nIran's president subsequently warned that any aggression against Khamenei would be considered an act of war. Meanwhile, reports estimate that the regime has killed over 16,000 citizens since the beginning of January protests, with countless others injured.\n\nAs Trump opts for a dual-track approach, focusing on diplomatic measures alongside military options, Iranians remain hopeful for U.S. intervention amidst the regime's brutal crackdown and ongoing violence.\n\n**In Other News**\n- The Syrian government reached a ceasefire with the U.S.-backed Syrian Democratic Forces.\n- Portugal's presidential elections hinted at Antonio Jose Seguro leading, with a runoff set against national opposition leader André Ventura.\n- Guatemala's Interior Ministry confirmed violent gangs are responsible for the deaths of police officers while taking control of several prisons.\n- Ugan",
    "redirectionUrl": "https://thedispatch.com"
  }
]