[
  {
    "uid": "morning-dispatch-2026-02-05",
    "updateDate": "2026-02-05T13:02:41.729Z",
    "titleText": "The Dispatch - Morning Briefing",
    "mainText": "**Homan Withdraws Agents From Minnesota**\nWhite House immigration czar Tom Homan announced on Wednesday that 700 federal law enforcement agents will withdraw from Minnesota following the shooting deaths of Renee Good and Alex Pretti at the hands of federal officers. During a press conference, Homan stated an “increase in unprecedented collaboration” with local authorities has reduced the need for federal agents to conduct arrests in the community. He stressed, “This is smart law enforcement, not less law enforcement.” It remains uncertain whether county jails that service Minneapolis and St. Paul have modified their policies about transferring inmates to the federal government only upon receipt of a judge's arrest warrant. Homan has recently met with local sheriffs to encourage increased cooperation as a condition of the agents’ withdrawal. A proposed agreement allowing jails to hold immigration targets for up to 48 hours after their release date was rejected by the Minnesota County Attorneys Association due to legal concerns.\n\nMinneapolis Mayor Jacob Frey and Minnesota Gov. Tim Walz welcomed the announcement but are advocating for a swifter drawdown of the remaining 2,000 federal agents. Walz also urged state-led inquiries into the deaths of Good and Pretti. A government attorney representing ICE was removed from her position after she commented in court that “the system sucks” and “this job sucks.”\n\n**Iran Talks Wobble**\nThe U.S. and Iran experienced confusion over scheduled talks for Friday, as Iranian officials requested the venue be shifted from Istanbul to Oman. Reports indicated the U.S. insisted that the discussions occur in Istanbul with the originally intended participants or not take place at all. While the Iranians showed a willingness to withdraw from the negotiations, a shift occurred after consultation with Arab countries led U.S. officials to agree to bilateral talks in Oman. Both U.S. and regional officials are expressing increasing pessimism about the likelihood of reaching a diplomatic resolution to avoid military confrontation, particularly as Iran displays a reluctance to negotiate on its ballistic missile program and support for regional proxies, despite provocative actions toward U.S. Navy vessels.\n\nPresident Donald Trump issued a warning during an NBC News interview stating that Iranian Supreme Leader Ali Khamenei “should be very worried.” Trump asserted, “We went in, we wiped out their nuclear. If I didn’t take out their nuclear, we wouldn’t have peace in the Middle East.” Concurrently, Iranian military officials highlighted the Khorramshahr missile, boasting a range exceeding 1,200 miles, in a show of military readiness.\n\n**Fulton County Officials Sue The Federal Government**\nOfficials in Fulton County, Georgia, filed a motion in federal court contesting the FBI's recent seizure of county election records and ballots. They are demanding the unsealing of the affidavit that secured the search warrant. Robb Pitts, Chair of the Fulton County Board of Commissioners, declared in a press conference, “We will fight using all resources against those who seek to take over our elections. Our Constitution itself is at stake in this fight.”\n\n**Russia-Ukraine Talks Continue**\nU.S.-brokered negotiations between Ukraine and Russia resumed in Abu Dhabi on Wednesday, with parties expressing a focus on practical solutions, though significant distances remain on critical matters, such as security guarantees for Ukraine and the status of occupied territories. Furthermore, EU officials have agreed to a 90 billion euro loan package for Ukraine, which includes 60 billion euros for military aid and 30 billion euros as general budget support. In a separate development, Russia launched an attack with 183 drones and two ballistic missiles targeting Kyiv and Sumy, although no casualties have been reported.\n\n**Supreme Court Denies Emergency Application on California Redistricting**\nOn Wednesday, the Supreme Court denied an emergency request from California Republicans to pause the implementation of the state’s new congressional map amid an ongoing legal challenge. The decision was made through an unsigned, one-sentence order without any public dissents. The request arose due to controversies stemming from Trump's influence to redraw congressional districts in Texas, which aimed to diminish Democratic",
    "redirectionUrl": "https://thedispatch.com"
  }
]