[
  {
    "uid": "morning-dispatch-2026-01-14",
    "updateDate": "2026-01-14T04:40:43.975Z",
    "titleText": "The Dispatch - Morning Briefing",
    "mainText": "**Is Cuba Next?**\n**Iran Protests Enter Third Week**\nIranians continue to protest against the regime and rising inflation, with the human rights network HRANA reporting 646 total deaths and over 10,000 arrests since the protests began on December 28, 2025. The protests have spread to at least 185 cities across all 31 Iranian provinces.\n\n**Quick Hits: Today’s Top Stories**\n- President Donald Trump announced plans to impose a 25 percent tariff on any country doing business with the Iranian regime, a statement that drew condemnation from the Chinese government, which stated it would take necessary measures to protect its interests.\n- Trump also claimed that there were no ongoing talks with Iran beyond technical contacts regarding migration.\n- In response to the investigations of Federal Reserve Chairman Jerome Powell's testimony before Congress, politicians from both parties criticized the federal government’s criminal investigation, describing it variously as coercive and unwarranted.\n- A report reveals that U.S. and Taiwanese officials are closing in on a trade deal that would reduce tariffs on Taiwanese goods in exchange for a significant investment from the Taiwan Semiconductor Manufacturing Company in U.S. projects.\n\n**Venezuela Releases More Prisoners**\nThe Venezuelan government announced the release of 24 political prisoners, according to a leading human rights organization, bringing the total released to 41 out of an estimated 800. The government claims it has freed 116 individuals.\n\n**Kelly Sues Hegseth**\nDemocratic Senator Mark Kelly of Arizona has filed a lawsuit against Defense Secretary Pete Hegseth and others, seeking to block actions that would downgrade his military rank and reduce his retirement pay. Kelly claims he was subjected to punitive retribution for his comments urging military members not to follow unlawful orders.\n\n**Cuba Under Scrutiny**\nIn light of U.S. actions toward Venezuela, President Trump has set his sights on Cuba, announcing that the country’s government can no longer rely on oil and financial support from Venezuela. Trump warned Cuba to negotiate quickly as he hinted at potential military action.\n- Despite claims of Venezuela’s major oil supply to Cuba, serious economic crises persist in Cuba, with many citizens experiencing extreme poverty.\n- While analysts suggest that Cuba may face pressure to reform in response to U.S. actions, the country remains tightly controlled, and another uprising seems unlikely due to an exodus of many able-bodied individuals in recent years.\n\n**In Other News**\n- Former Democratic Representative Mary Peltola has declared her candidacy for the 2026 Senate race in Alaska, challenging incumbent Republican Dan Sullivan.\n- The Defense Department is reported to have used military aircraft disguised as civilian planes during airstrikes that killed 11 accused cartel members last September.\n- Federal district judges are issuing injunctions to restore funding cuts to various health organizations.\n\n**Around the World**\n- The Hungarian government granted asylum to former Polish minister Zbigniew Ziobro amid ongoing investigations into alleged abuse of power.\n- Anti-Hamas groups have reported the killing of a Hamas-affiliated police officer in recent confrontations.\n\nThis covers key developments including unrest in Iran, U.S. trade negotiations, and ongoing tension in Cuba and Venezuela.",
    "redirectionUrl": "https://thedispatch.com"
  }
]