[
  {
    "uid": "the-dispatch-morning-briefing-2026-01-05t00-15-24-252z",
    "updateDate": "2026-01-05T00:15:24.252Z",
    "titleText": "The Dispatch — Morning Briefing",
    "mainText": "**Russia's Lunar Nuclear Ambitions**\n\nRussia’s state space corporation has accelerated its plans to build a nuclear power plant on the moon within the next decade. NASA also aims to construct a lunar nuclear reactor by the year 2030. In other news, lifeforms detected on the moon reportedly communicated, stating, “Not in my backyard!”\n\n**Quick Hits: Today’s Top Stories**\n\n- **U.S. Strikes ISIS Targets in Nigeria**: President Donald Trump announced that the U.S. conducted airstrikes against ISIS targets in northwestern Nigeria on Thursday evening. The operation was coordinated with Nigeria’s military, resulting in the deaths of multiple Islamic State terrorists. Nigerian officials confirmed intelligence sharing preceding the operation, which was approved by President Bola Tinubu. According to the New York Times, over a dozen Tomahawk cruise missiles were fired from a U.S. naval ship, hitting two ISIS-linked camps. This attack follows Trump’s earlier threats to intervene in Nigeria on behalf of Christian communities facing violence from Islamic militants, with Defense Secretary Pete Hegseth suggesting further actions may follow.\n\n- **Zelensky Discusses Peace Plan with Trump**: Ukrainian President Volodymyr Zelensky met with Trump at Mar-a-Lago to negotiate a revised U.S.-backed peace plan to resolve the conflict between Ukraine and Russia. The meeting came after a phone call between Trump and Russian President Vladimir Putin described as “good and very productive.” However, no major breakthroughs were achieved due to several complex issues, amidst a resurgence of Russian attacks on Ukraine. Over 500 drones and 40 missiles were launched at residential and energy infrastructure in Kyiv, resulting in one death and injuries to 27 others. Poland scrambled fighter jets in response to the Russian assault on Kyiv.\n\n- **Supreme Court Blocks National Guard Deployments in Illinois**: In a decision on Tuesday, the Supreme Court ruled that the Trump administration could not deploy National Guard troops in Illinois, upholding a lower court order prohibiting the move during ongoing litigation. Justices Samuel Alito, Clarence Thomas, and Neil Gorsuch wrote a dissent. Trump had previously announced this mobilization in October, which faced challenges from the state of Illinois and the city of Chicago.\n\n- **Violence in Israel**: A Palestinian man from the West Bank executed a ramming and stabbing attack in northern Israel on Friday, killing a 68-year-old man and a 19-year-old woman before being shot by a civilian. In retaliation, Israeli officials conducted a counter-terrorism operation in Qabatiya, arresting the attacker’s brothers who were working illegally in Israel. This escalation comes ahead of a scheduled meeting between Israeli Prime Minister Benjamin Netanyahu and Trump, focusing on ongoing conflicts involving Hamas and Hezbollah.\n\n- **Cable Plane Crash in Texas**: A Mexican naval plane transporting medical patients crashed into Galveston Bay last Monday, killing six onboard, including a 2-year-old child. Two survivors were rescued, with one woman saved by a witness. Mexican President Claudia Sheinbaum indicated that contact was lost with the plane shortly before it went down, and an investigation is underway, with additional scrutiny from the U.S. National Transportation Safety Board.\n\n**Entertainment Highlights**\n\n2025 brought notable moments in pop culture, with highlights including the television series *Pluribus*, created by Vince Gilligan, which explores themes of individuality amidst conformity, and the film *KPop Demon Hunters*, blending entertainment with significant themes of redemption and self-acceptance. Other recommendations include *Jay Kelly*, *Wake Up Dead Man: A Knives Out Mystery*, and *Severance*, each presenting unique narratives and character developments amidst larger societal themes.\n\n**Today’s Must-Read**\n\n*The Dormant Border Crisis at the Sunniest City on Earth* — Just three years ago, Yuma, Arizona, was overwhelmed by a surge of migrants crossing the southern border, with encounters now falling to single digits. Local leaders reflect on the previously dire situation and the lesson",
    "redirectionUrl": "https://thedispatch.com"
  }
]