[
  {
    "uid": "morning-dispatch-2026-01-14",
    "updateDate": "2026-01-14T13:01:01.519Z",
    "titleText": "The Dispatch - Morning Briefing",
    "mainText": "**Justice Department Goes After Jerome Powell**\n\nFederal Reserve Chair Jerome Powell made headlines this week after revealing that the Justice Department had served him with grand jury subpoenas related to a criminal investigation into the renovations of the Federal Reserve headquarters. This inquiry follows accusations against Powell of lying under oath regarding the project, which is rumored to have exceeded its budget by billions. President Donald Trump commented that Powell is either \"incompetent or crooked\" given the claims of excessive spending.\n\nIn his video response, Powell emphasized that the investigation is less about cost overruns and more about safeguarding the Federal Reserve's ability to set interest rates based on economic conditions rather than political pressure. He stated, \"This unprecedented action should be seen in the broader context of the administration’s threats and ongoing pressure.\"\n\nThis investigation is believed to be part of a larger effort by the Trump administration to exert influence over the Federal Reserve, an uncommon scenario in the U.S., where federal prosecutions of central bank chairs are usually rare.\n\n**Thousands of Protesters Killed in Iran**\n\nRecent reports indicate that at least 12,000 Iranians have died amid government crackdowns on nationwide protests, according to sources from Iran International and CBS News. Some estimates suggest the death toll may reach 20,000, while Iranian authorities have reported over 3,000 deaths, attributing them to \"terrorists.\" Eyewitness accounts describe extreme violence, including snipers targeting crowds and execution-style killings by state personnel. Protests continue as demonstrators voice their opposition against Iranian Supreme Leader Ayatollah Ali Khamenei.\n\nPresident Donald Trump expressed support for the protesters, announcing on social media that he has canceled all meetings with Iranian officials until the violence stops.\n\n**A White House Meeting on Greenland**\n\nToday, the foreign ministers from Denmark and Greenland are set to meet with Vice President J.D. Vance and Secretary of State Marco Rubio at the White House to discuss the administration's expressed intent to acquire Greenland. Greenlandic Minister Naaja Nathanielsen voiced concerns in the British Parliament, noting that citizens are \"very, very worried\" about the U.S. push. Sen. Chris Coons and Sen. Thom Tillis will lead a congressional delegation visiting Denmark later this week.\n\nGreenland’s Prime Minister Jens-Frederik Nielsen stated that his country would prefer to remain allied with Denmark rather than pursue a partnership with the U.S.\n\n**Somalis Lose Temporary Protected Status**\n\nThe Trump administration has announced the termination of Temporary Protected Status (TPS) for immigrants from Somalia, affecting approximately 2,500 individuals currently residing in the U.S. This status was granted in the wake of the Somali civil war in 1991, allowing individuals to live and work in the U.S. due to ongoing violence and instability in their home country. Secretary of Homeland Security Kristi Noem stated that conditions in Somalia have improved enough to no longer warrant TPS designation.\n\n**BLS Finds Inflation Remains Stable**\n\nThe Bureau of Labor Statistics reported that inflation rates held steady at 2.7% in December, matching November’s figures. Core inflation, excluding food and energy prices, rose to 2.6%. These trends are above the Federal Reserve's target but align with economic predictions, showcasing limited impact from recent tariffs. The Federal Open Market Committee’s next meeting is scheduled for January 27.\n\nIn light of the BLS report, Trump urged Powell to cut interest rates significantly.\n\n**U.S. Condemns Russia**\n\nAt the United Nations, U.S. Deputy Ambassador to the U.N. Tammy Bruce condemned recent Russian missile strikes against civilians in Ukraine, labeling them as a dangerous escalation. The meeting followed a drone and missile attack that left four individuals dead and resulted in damages to critical infrastructure. Ukraine's parliament has denounced a recent designation of defense officials, demonstrating ongoing tensions in the region.",
    "redirectionUrl": "https://thedispatch.com"
  }
]