[
  {
    "uid": "morning-dispatch-2026-01-20",
    "updateDate": "2026-01-20T13:01:09.761Z",
    "titleText": "The Dispatch - Morning Briefing",
    "mainText": "### More Pressure to Buy Greenland\nPresident Donald Trump continues to pressure European nations to assist the U.S. in acquiring Greenland. This includes a statement made to NBC News where Trump declined to comment on whether he would deploy military force for this purpose. Norwegian Prime Minister Jonas Gahr Støre disclosed that Trump texted him, stating, \"Considering your country decided not to give me the Nobel Peace Prize for having stopped 8 Wars PLUS, I no longer feel an obligation to think purely of Peace, although it will always be predominant,\" and demanded that the U.S. gain control over Greenland. In response, Denmark has dispatched an additional 58 troops to Greenland, raising their military presence to over 100 soldiers.\n\n- Trump announced plans to meet NATO Secretary-General Mark Rutte at Davos this week, emphasizing, \"Greenland is imperative for National and World Security.\" Denmark confirmed they will not attend this meeting.\n- The European Union has called for an emergency summit to consider utilizing its Anti-Coercion Instrument, potentially authorizing over $100 billion in retaliatory tariffs against the United States.\n\n### “Board of Peace” Formalizes\nFrance has officially rejected Trump's invitation to join the “Board of Peace,” citing concerns that its powers might extend beyond governing Gaza and conflict with United Nations mandates. In retaliation, Trump threatened a 200 percent tariff on French wine. European diplomats have indicated that except for Hungary, no EU countries are expected to participate. Meanwhile, Russia has received an invitation to join, while Chinese officials confirmed their invitation as well. Confirmed members of this board include Hungary, Vietnam, Argentina, Kazakhstan, Morocco, and Canada, which has agreed to participate in principle. Member nations will be charged $1 billion for a permanent seat on the board.\n\n- The White House is anticipated to publish the official list of members during the upcoming World Economic Forum.\n- Israeli Prime Minister Benjamin Netanyahu expressed that Israel is at odds with the U.S. regarding the participation of Turkey and Qatar, suggesting that his objections were coordinated prior to his remarks.\n- Reports indicate that Israel is blocking members of the Palestinian National Committee for Gaza's administration from entering the territory, complicating Trump’s plans for the technocratic body to take over civilian administration by week’s end.\n\n### Syrian Ceasefire Frays\nThe ceasefire in Syria between government forces and the Kurdish-led Syrian Democratic Forces collapsed less than 24 hours after being established. Fighting erupted near al-Aqtan prison, resulting in over 12 deaths on both sides. In the turmoil, between 120 and 200 ISIS detainees escaped from al-Shaddadi prison, although authorities later reported that 130 had been recaptured, with ongoing security sweeps.\n\n- A five-hour meeting in Damascus between Syrian President Ahmad al-Sharaa and SDF commander Mazloum Abdi failed to reach an agreement, prompting al-Sharaa to give Abdi a deadline to meet demands, or face renewed military action.\n- Following the ceasefire collapse, the U.S. has repositioned F-15 fighter jets to Jordan to bolster regional security.\n\n### Investigations in Minnesota\nThe Justice Department has filed an appeal to the 8th Circuit, contesting a federal judge’s restrictions on ICE agents in Minneapolis that prohibit them from arresting lawful protesters and observers. At the same time, it has launched an investigation into protests at a St. Paul church, which disrupted services where a pastor is linked to a local ICE field office. Attorney General Pam Bondi stated that federal law enforcement will respond firmly to attacks on law enforcement and intimidation of Christians, mentioning investigations into potential FACE Act violations. Governor Tim Walz's spokesperson confirmed that he does not support interruptions at places of worship.\n\n- About 1,500 soldiers from the Army's 11th Airborne Division are on standby in Alaska, despite Trump suggesting earlier that there was currently no necessity to use the Insurrection Act.\n- The Department of Justice is also investigating both Governor Walz and Minneapolis Mayor Jacob Frey, though neither has been charged with a crime.\n\n### Train Crash in Spain\nSpanish investigators have identified a faulty rail joint a",
    "redirectionUrl": "https://thedispatch.com"
  }
]