[
  {
    "uid": "morning-dispatch-2026-02-19",
    "updateDate": "2026-02-19T13:01:59.173Z",
    "titleText": "The Dispatch - Morning Briefing",
    "mainText": "### Who Gets Warner Bros.?\n\n**Warner Bros. Box Office Success and Acquisition Bids**\n\"Wuthering Heights\" topped the box office over Presidents' Day and Valentine's Day weekend, earning $83 million worldwide, marking the ninth consecutive Warner Bros. film to achieve this on its opening weekend. Netflix had made a high-profile $150 million bid to acquire distribution rights for the film but was outbid by Warner Bros.’ $80 million offer, surprising many industry analysts. The success of this movie has intensified discussions about Netflix’s potential acquisition of Warner Bros.\n\nOn December 5, Netflix announced a $72 billion deal to acquire Warner Bros, including its film and television studios, HBO brand, gaming business, and HBO Max streaming service, at $27.75 per share. This deal values the film studio at $82.7 billion. Warner Bros. has stated that Paramount's offers have not met their expectations, maintaining they remain \"inferior\" to Netflix's. Additionally, Netflix has permitted a seven-day period for Warner Bros. to renegotiate with Paramount, who is expected to present its final offer soon.\n\n**Military Movements in the Middle East**\nThe United States has begun moving more military forces into the Middle East, with indications it is preparing for possible military action against Iran. Observations of numerous flights of military aircraft suggest an increasing urgency within the Obama administration regarding Iran's actions. Reports indicate President Donald Trump is close to approving a military attack, as stated by a Trump advisor who noted, \"The boss is getting fed up.\"\n\nMoreover, ongoing U.S.-Iran talks in Geneva seem to be yielding little progress, with Vice President J.D. Vance remarking on clear red lines being set by the U.S. that Iran is not willing to acknowledge.\n\n**U.S. and Japan Investment Initiatives**\nThe United States and Japan have unveiled plans for Japan to invest up to $36 billion in various U.S. oil, gas, and mineral projects, the initial commitments stemming from a $550 billion trade agreement reached last year. Notably, $33 billion of this will fund a natural gas facility in Portsmouth, Ohio, owned by Softbank Group subsidiary SB Energy, anticipated to generate around 9.2 gigawatts of energy.\n\n**Moderna's Vaccine Review**\nThe Food and Drug Administration has reversed its earlier rejection of an application to review a new mRNA flu vaccine developed by Moderna, allowing it to move forward after indications of flaws were previously identified in its research design. This decision followed a meeting between FDA head Martin Makary and President Trump, who reportedly expressed disappointment about the prior rejection.\n\n**Pressure on Cuba by U.S. Officials**\nSecretary of State Marco Rubio has reportedly engaged in secret talks with Raul Guillermo Rodriguez Castro, the grandson of Cuba's dictator, as part of efforts to find a reliable contact within the Cuban government. The U.S. has been seeking regime change in Cuba; however, discussions about the specifics remain under deliberation.\n\n**International Developments**\nFormer British Prince Andrew Mountbatten-Windsor was arrested on suspicion of misconduct in public office. In South Korea, former President Yoon Suk Yeol has been sentenced to life imprisonment linked to his action through martial law. Additionally, Israel has announced that military tribunal trials will be held for detained Hamas fighters connected to the October 7 attacks.\n\n**Miscellaneous Updates**\nThe FBI and Minnesota police are investigating an incident involving alleged excessive force used by ICE agents against a Mexican national. Reports also suggest the White House is planning a significant military presence in Gaza. Meanwhile, a coalition of advocacy groups has filed a lawsuit against the EPA over greenhouse gas emission regulations. Lastly, eight skiers tragically lost their lives in an avalanche in California, with intensive search efforts currently underway.",
    "redirectionUrl": "https://thedispatch.com"
  }
]