[
  {
    "uid": "morning-dispatch-2026-01-17",
    "updateDate": "2026-01-17T13:00:49.358Z",
    "titleText": "The Dispatch - Morning Briefing",
    "mainText": "### Weekend Focus: Books\nThis weekend, we’re focusing on books. Dispatch Contributing Writer Leah Libresco Sargeant has reviewed a unique little book titled *Maintenance of Everything, Part 1*, written by hippie futurist Steward Brand. The book consists of two chapters: a tightly written first chapter on the 1968 *Sunday Times* Golden Globe Race, which sent sailboats to circumnavigate the world, and a sprawling second chapter titled ‘Vehicles (And Weapons),’ which features five elaborated digressions and two postscripts. Libresco Sargeant notes the second chapter is weaker but remarks that her copy became studded with dog ears as she placed several library holds based on Brand's citations and readers’ marginalia.\n\n### Upcoming Book Release\nMeanwhile, radio show host and writer Leigh Snead has shared an adapted excerpt from her forthcoming book *Infertile but Fruitful: Finding Fulfillment When You Can’t Conceive*, which will be published by Sophia Institute Press on January 20. In this book, Snead discusses her and her husband’s decision to expand their family through adoption. She expresses her understanding of the hesitation many couples face when considering adoption after struggling with infertility, highlighting how it can feel like a significant letting go of the biological children they had hoped to have.\n\n### Recent Commentary\nEarlier this week, Dispatch Editor-in-Chief Jonah Goldberg discussed the warlike tone of the Trump administration’s communications and how it twists patriotic sentiment into fascistic propaganda. Additionally, congressional reporter Charles Hilu covered a bill that would significantly restrict who can pursue surrogacy in the United States.\n\n### Music Highlight\nIn a special retrospective, Andy Smarick reflects on the legendary Stevie Ray Vaughan, who passed away in 1990. Vaughan recorded a live concert at the El Mocambo in Toronto, a performance that is now considered a tour de force in blues music. Known as SRV, he is often lauded as the greatest American blues guitarist. He was renowned for his unique ability to blend power and sensitivity, alongside his extraordinary guitar technical skills. SRV's version of Jimi Hendrix's \"Voodoo Child\" has been described as superior to the original. The set consists of 12 songs, capturing his raw talent and defying the pop trends of the 1980s.\n\n### Cultural Commentary\nIn a broader context, Smarick discusses how America has created the blues yet often neglects its foundational significance in jazz, rock, and other music genres. He notes that many blues progenitors like Robert Johnson and Muddy Waters remain unheard and unrecognized in mainstream culture, suggesting an ongoing struggle for the genre's rightful place in American music history.\n\n### Art Highlight\nThis week's featured artwork is *Journeys Through Time* by Emily B. Fleischman, chosen by Eileen Heise. She shares her mother's journey as an artist, emphasizing the peaceful energy of her artwork. Heise has been a member of The Dispatch since 2023, expressing her trust in the platform's commitment to well-researched news and diverse viewpoints.",
    "redirectionUrl": "https://thedispatch.com"
  }
]