[
  {
    "uid": "morning-dispatch-2026-02-25",
    "updateDate": "2026-02-25T13:02:41.734Z",
    "titleText": "The Dispatch - Morning Briefing",
    "mainText": "**Dispatch Energy Symposium in Dallas**\nThe Dispatch team is heading to Dallas, Texas for *Dispatch Energy: The Current State*, a symposium focusing on the future of energy innovation. Guests including Kevin D. Williamson, Jonah Goldberg, Steve Hayes, and other prominent Dispatch authors will bring the *Dispatch Energy* newsletter to life. Tickets for the event are nearly sold out.\n\n**Record Late Library Return**\nA man returned a biography of Henry Ford to Richland Public Library in Washington last week that was 23,349 days, or 63 years, overdue. Originally, the estimated fine was several thousand dollars, but the library eliminated overdue fees in 2022, creating possibly the only instance where ignoring a bill for so long yielded a positive outcome.\n\n**Quick Hits: Today’s Top Stories**\n**Rubio Briefs Congress on Iran**\nSecretary of State Marco Rubio briefed eight congressional members on Iran on Tuesday, sharing classified information concerning preparations for potential military action. CIA Director John Ratcliffe also provided a briefing during this meeting. Afterward, Senate Minority Leader Chuck Schumer stated, \"This is serious, and the administration has to make its case to the American people.\" Senate Republicans cautioned Iran: \"Iran’s leaders know the consequences for pursuing nuclear weapons. They should not repeat past mistakes.\" Two Lebanese officials indicated that Israel would strike if the Iranian-backed group Hezbollah supports Iran in a U.S. conflict. U.S. and Iranian officials are set to hold indirect talks on Thursday in Geneva.\n\nIn Iran, protests against the regime at university campuses have continued for four consecutive days. Reports indicate that some student demonstrators were beaten by government-allied militia, but no gunfire was reported. The Iranian Revolutionary Guard Corps held military drills along the southern coast, and it has been reported that Iran is nearing a deal with China for supersonic anti-ship cruise missiles.\n\nIran's Foreign Minister Abbas Araghchi stated that Iran will never develop a nuclear weapon, although it will not renounce its right to peaceful nuclear technology.\n\n**Hegseth Threatens Anthropic**\nDefense Secretary Pete Hegseth warned Anthropic CEO Dario Amodei that he has until Friday to grant the Pentagon unrestricted access to its AI tools or face serious consequences. Hegseth indicated the Defense Department may revoke Anthropic’s $200 million defense contract and label the company as a \"supply chain risk,\" potentially using the Defense Production Act to enforce compliance. Amodei has pushed back against using Anthropic's models for military applications, maintaining a commitment not to alter their standards.\n\n**Supreme Court on Postal Service Liability**\nIn a closely contested 5-4 decision, the Supreme Court ruled that federal law protecting the U.S. Postal Service extends to cases where mail is intentionally withheld, meaning that the agency cannot be sued for such actions. The case involved Lebene Konan, who sued claiming racial harassment after employees withheld her mail. The majority ruling states that the law bars claims related to mail loss or miscarriage, a decision met with dissent from several justices.\n\n**Russia Accuses Europe of Nuclear Ambitions**\nRussia’s SVR intelligence agency has claimed that the U.K. and France are attempting to supply Ukraine with nuclear capabilities, alleging that these countries are planning to present nuclear weapons as Ukrainian developments. This has been strongly dismissed by officials from both nations and Ukrainian representatives, labeling the claims as disinformation.\n\n**International Developments in Ukraine**\nThe U.K. and Australia announced new sanctions against Russia, while Canada implemented sanctions targeting illicit oil shipments and pledged approximately $220 million in new aid for Ukraine. Ukrainian officials expect that strikes on Russian assets may backfire on their investments in Kazakhstan.\n\n**Trump Addresses Congress in State of the Union**\nPresident Donald Trump delivered an extensive State of the Union address lasting 108 minutes, the longest recorded. He proclaimed the economy and nation had never been more robust and expressed discontent with the Supreme Court’s recent rulings affecting his tariff policy. He emphasized that he would not permit Iran to possess nuclear weapons but",
    "redirectionUrl": "https://thedispatch.com"
  }
]