[
  {
    "uid": "morning-dispatch-2026-02-17",
    "updateDate": "2026-02-17T13:02:53.031Z",
    "titleText": "The Dispatch - Morning Briefing",
    "mainText": "**Israel’s West Bank Land Push**\nFor the first time since the October 7 massacre in 2023, Israel is not at war with any nation or terror group. The Gaza peace plan is in its second phase, the ceasefire has held, and President Donald Trump’s Board of Peace is working to arrange temporary governance of Gaza. However, with elections approaching later this year, a new political conflict is emerging within Israel.\n\nIsraeli Prime Minister Benjamin Netanyahu’s Cabinet recently approved a new land registration process for Area C of the West Bank, exclusively under Israeli control. This initiative aims to create a uniform property ownership certification system, where unregistered land could transfer to state ownership after review. Palestinians express concern that this process could lead to losing their property rights if ownership records are deemed inadequate.\n\nThe U.S. State Department, in a 2024 report, pointed out that many land titles are outdated and ownership rights may be unclear due to various conflicting laws from past governing regimes. The office of Palestinian Authority President Mahmoud Abbas stated that this decision represents de facto annexation of occupied Palestinian territory and aims to entrench illegal settlement activities. Global reactions include condemnation from U.N. Secretary-General António Guterres, who labeled the land registration as unlawful, and various countries that criticized it as a violation of Palestinian sovereignty. The White House has generally opposed further developments in the West Bank.\n\nWhy is Netanyahu pushing this policy, and what could the consequences be?\n\nThe 1995 Oslo II Accords delineated jurisdiction in the West Bank: Area A under Palestinian Authority control, Area B shared jurisdiction, and Area C under Israeli protection. Since 1968, Israel has not facilitated land registration on non-Israeli-owned land in the West Bank. With over 300,000 Palestinians residing in Area C, while most Palestinians live in Areas A and B, many still own land in Area C.\n\nViolence has surged throughout the West Bank, with estimates from the U.N. indicating over 900 Palestinians displaced in 2026 alone due to attacks by Israeli settlers.\n\nThe new land registration process implies significant ramifications. Israeli officials anticipate it will take more than 18 months to catalog each property and 30 years to identify unregistered land, with a goal to log 15% of such land within five years. Funding of approximately $79 million has been allocated for this process through 2030. This follows the recent repeal of restrictions from Jordanian rule on land purchases by Israeli Jews.\n\nThe Cabinet argues that this new process is a response to alleged illegal registrations promoted by the Palestinian Authority but has not provided evidence for these claims. Israeli Justice Minister Yariv Levin stated that the land belongs to the people of Israel and deemed this system an expression of Israel’s commitment to strengthen its control over the territory.\n\nElliott Abrams, a senior fellow at the Council on Foreign Relations, noted that while the idea seems logical on its own, it coincides with efforts from multiple coalition members to assert control over more land for settlement purposes.\n\nNetanyahu leads the Likud party, which secured 32 of the 120 Knesset seats in the last election but could only form a government through a coalition with further right parties, including Bezalel Smotrich’s Religious Zionism and Itamar Ben Gvir’s Otzma Yehudit. Tensions within this coalition have escalated.\n\nWhile the Likud party has historically avoided explicit annexation calls, policies have increasingly been adopted that strengthen Israeli governance in the West Bank, spurred by pressure from coalition partners. Analysts suggest Netanyahu may be acting to solidify his right-wing voter base ahead of the elections. Significant figures in his cabinet have openly supported outright annexation following recognitions of a Palestinian state by several Western countries.\n\nThe Trump administration has not publicly responded to the new land registration policy, although it has voiced opposition to any annexation plans of the West Bank. Trump indicated that addressing Israel's land issues is not a current priority, stressing instead the importance of a secure West Bank for overall regio",
    "redirectionUrl": "https://thedispatch.com"
  }
]