[
  {
    "uid": "morning-dispatch-2026-02-10",
    "updateDate": "2026-02-10T13:02:31.551Z",
    "titleText": "The Dispatch - Morning Briefing",
    "mainText": "**Who Wins the Redistricting Race?**\nThe most aggressive wave of mid-decade redistricting in modern American history will face its first real-world test in less than a month, when voters in North Carolina and Texas head to the polls on March 3 to cast primary ballots in newly redrawn congressional districts. But they’re hardly alone: California, Missouri, Ohio, Utah, New York, and Florida have all redrawn or begun efforts to redraw their lines outside the ordinary decennial cycle. On Friday, Virginia Governor Abigail Spanberger signed a bill scheduling an April referendum to allow the state legislature to redraw its congressional map.\nThis isn’t normal.\n\nAs reported by The Dispatch’s David Drucker, redistricting typically occurs every 10 years, coinciding with the reapportionment of House districts as determined by the decennial census mandated by the Constitution. While there’s nothing in federal or state law preventing Democrats and Republicans from redrawing congressional maps in between censuses, this usually happens only under exigent circumstances, such as a court order.\nTo boost Republicans’ chances of retaining the House in the November midterm elections, the White House called on Texas Republicans to redraw their congressional map last June, hoping to gain as many as five additional seats. This move prompted California Governor Gavin Newsom to push through a countermeasure, igniting a ripple effect.\n\n“Mid-decade redistricting—at least in the modern era since the 1970s—has been extremely rare,” said Richard Pildes, a constitutional law professor at New York University. He noted that mid-decade moves have typically been struck down by courts, including Texas’ redistricting in 2003 and Georgia’s in 2005.\nFed up with politicians’ manipulation of the system for partisan gains, Pildes remarked,\n“I think it’s unfortunate that this tit-for-tat dynamic has moved in that direction, but it’s understandable why states don’t want to unilaterally disarm themselves.”\n\nOn Monday, a federal appeals court cleared the way for the Trump administration to revoke deportation protections for roughly 61,000 individuals from Honduras, Nepal, and Nicaragua currently residing in the United States under temporary protected status. This comes as the Justice Department plans to transfer federal inmates who received death sentence commutations from President Joe Biden to the federal supermax prison in Florence, Colorado.\nIn other news, the Iranian regime has initiated a crackdown on internal reformist political leaders, arresting at least seven politicians and extending court summons to several others. Prominent reformist figures had criticized the regime for violent actions against peaceful demonstrators. Reports indicate that some arrested officials had planned a public statement demanding Supreme Leader Ali Khamenei's resignation.\n\nIn Venezuela, Juan Pablo Guanipa, a lawyer and ally of opposition leader María Corina Machado, was detained again just 24 hours after being released among 35 political prisoners on Sunday. Venezuelan authorities claimed Guanipa was arrested for “non-compliance” with unspecified terms of his release.\n\nThe Israeli Defense Forces (IDF) reported on Monday that four armed Palestinian gunmen emerged from a tunnel in Rafah, opening fire at Israeli soldiers, leading to their deaths. The IDF described this incident as a blatant violation of the ceasefire with Hamas, which added that the gunmen had \"chosen martyrdom over surrender.\" In other developments, IDF forces captured a senior officer of the Al-Jama’a al-Islamiyya terrorist group, killed a Hezbollah artillery commander, and seized a Hezbollah operative involved in terrorism planning.\n\nFinally, NATO is reportedly planning an Arctic mission in Greenland that could involve joint military drills and enhanced surveillance operations. Also, a vessel linked to former Venezuelan leader Nicolás Maduro's shadow fleet was seized by the U.S. military, signaling ongoing tensions between the nations.",
    "redirectionUrl": "https://thedispatch.com"
  }
]