[
  {
    "uid": "morning-dispatch-2026-02-12",
    "updateDate": "2026-02-12T13:01:53.723Z",
    "titleText": "The Dispatch - Morning Briefing",
    "mainText": "**Inside The DHS Funding Fight**\nFebruary 12, 2026\n\n**Congress Votes to End ‘National Emergency’**\nThe House of Representatives voted 219-211 on Wednesday to advance legislation ending the national emergency declared by President Donald Trump to justify his administration’s tariff hikes on Canada. This resolution, if enacted, would effectively nullify the tariffs. Votes were mostly along party lines, with six Republicans joining Democrats to approve the legislation and Democratic Rep. Jared Golden of Maine voting against it. The bill moves to the Senate, where it will receive privileged treatment under the National Emergencies Act, requiring only a simple majority to pass. The Senate passed a similar resolution in April 2025, but it was blocked by House Republican leadership. However, the measure is unlikely to secure the two-thirds majority required to override a presidential veto. Just before the vote, Trump warned on Truth Social that congressional Republicans who support the bill would “seriously suffer the consequences come Election time, and that includes Primaries!”\n\n**BLS Releases Job Numbers**\nA new report from the Bureau of Labor Statistics indicates that the U.S. economy added 130,000 nonfarm payroll jobs in January, surpassing the Dow Jones estimate of 55,000 jobs and up approximately 82,000 from December. Job gains were primarily seen in the health care, social assistance, and construction sectors, while the federal government lost jobs. The unemployment rate ticked down to 4.3 percent, a 0.1 percent decrease from December but a 0.3 percent increase from January 2025. Trump remarked on Truth Social, “GREAT JOBS NUMBERS, FAR GREATER THAN EXPECTED!” and urged the Federal Reserve to lower interest rates.\n\n**FAA Temporarily Closes El Paso Airspace**\nThe Federal Aviation Administration closed the airspace above El Paso, Texas, and grounded flights for approximately eight hours. Initial reports suggested a 10-day closure before being rescinded. The Trump administration claimed the closure responded to FAA and Defense Department operations to counter incursions by drones controlled by Mexican cartels. Subsequent reports clarified that the pause followed the deployment of an anti-drone laser by Customs and Border Protection agents. A DOD official was reportedly present during the operation. El Paso Mayor Renard Johnson criticized the federal government for a lack of coordination during the shutdown.\n\n**Netanyahu Visits White House**\nPresident Donald Trump hosted Israeli Prime Minister Benjamin Netanyahu at the White House for discussions on rising tensions with Iran and the situation in the Gaza Strip. Trump described the meeting as “very good” but added that no definitive decisions were made regarding negotiations with Iran. Netanyahu emphasized Israel's security needs amidst the discussions. Turkish Foreign Minister Hakan Fidan provided a positive outlook on U.S.-Iran negotiations, stating that the Americans seem willing to tolerate certain levels of Iranian enrichment. In Iran, President Masoud Pezeshkian addressed the nation, asserting the government was not pursuing nuclear weapon development.\n\n**More Russia-Ukraine Talks**\nUkrainian President Volodymyr Zelensky accepted an offer from the Trump administration for trilateral talks involving the U.S., Ukraine, and Russia, likely scheduled for February 17 or 18. The discussions will address territorial issues, including a proposal for a free economic zone in Ukraine’s eastern Donbas region currently occupied by Russia. Meanwhile, ongoing attacks from Russia on Ukrainian energy infrastructure have injured at least seven people.\n\n**Today in America**\n- The House voted 218-213 to pass the SAVE America Act, mandating proof of citizenship for voter registration.\n- The Trump administration has withdrawn remaining National Guard troops from Chicago, Los Angeles, and Portland.\n- Nigeria announced that the Trump administration agreed to send U.S. military forces to aid in training to combat Islamist militants.\n- Oklahoma Governor Kevin Stitt reported that Trump will invite all current U.S. governors to a National Governors Association meeting at the White House after initially excluding Democratic governors.\n- Team USA has garnered 12 medals at the Winter Olympics, including four golds.",
    "redirectionUrl": "https://thedispatch.com"
  }
]