[
  {
    "uid": "morning-dispatch-2026-02-16",
    "updateDate": "2026-02-16T13:02:02.978Z",
    "titleText": "The Dispatch - Morning Briefing",
    "mainText": "**DHS Shuts Down**\nThe Department of Homeland Security, or DHS, entered a government shutdown on Saturday after federal lawmakers failed to reach a deal to fund the agency. Although the government partially shut down on January 31, Congress quickly passed a bill to fund all federal agencies through September 30, except DHS, which received just a two-week funding extension. Congressional Democrats are demanding 10 proposed reforms for Immigration and Customs Enforcement and Customs and Border Protection to be included in any DHS funding bill, which the White House opposes. The shutdown is expected to impact over 13 percent of the federal workforce, with workers set to receive reduced pay on March 3 and begin missing paychecks on March 17. Most federal employees at the agency, including those at the Transportation Security Administration, are expected to continue working without pay. Affected employees will receive back pay for missed paychecks once lawmakers finalize a funding deal for DHS.\n\n- ICE and CBP operations will continue amid the shutdown, as these agencies remain funded through congressional appropriations under the One Big Beautiful Bill Act passed last year.\n- Senate Democrats blocked a bill on Thursday that would fund DHS with no extra restrictions, along with a separate proposal to provide a two-week funding extension. Senate leaders from both parties have indicated they will return early if the House can pass a deal.\n- The House has recessed as well, returning on February 23. Speaker Mike Johnson instructed members to avoid government-funded congressional delegation trips during the ongoing shutdown threat.\n\n**BLS Inflation Report**\nA report from the Bureau of Labor Statistics released Friday found that the consumer price index (CPI) increased by 2.4 percent year-over-year in January, representing a 0.3 percentage point decrease from the previous month. This marks the first time annual inflation has been below 2.4 percent since May 2025. The BLS attributed the rise primarily to increases in its shelter index, as well as hikes in airline fares, personal care, recreation, medical care, and communication costs. Conversely, energy costs fell by 1.5 percent from December to January. The core CPI, which excludes the more volatile categories of food and energy, rose by 2.5 percent year-over-year in January, the lowest rate since March 2021.\n- In a response to the report, White House spokesman Kush Desai stated that inflation is now “low and stable,” criticizing the Federal Reserve for not making additional interest rate cuts, which he described as “long-overdue.” The CPI remains above the central bank's target of 2 percent. U.S. stock indices showed little change following the report's release.\n\n**European Leaders: Navalny Was Murdered**\nThe foreign ministers of five European nations—U.K., France, Germany, Sweden, and the Netherlands—issued a joint statement on Saturday asserting that Russian opposition leader Alexei Navalny, who died in February 2024 while in Russian custody, was killed due to a lethal toxin found in his system. Investigators discovered epibatidine in samples from Navalny, a toxin produced by poison dart frogs. Despite claims from Russian authorities that Navalny died of natural causes, the European leaders stated that “Russia had the means, motive, and opportunity to administer this poison to him,” alleging that the Kremlin violated international law concerning the use of chemical weapons.\n- Russia's Foreign Ministry dismissed these findings, calling them an attempt to divert attention from problems facing the West. U.S. Secretary of State Marco Rubio described the report as “troubling” and confirmed that U.S. officials have no reason to doubt its validity.\n- British Foreign Minister Yvette Cooper mentioned that European nations are contemplating coordinated actions, including heightened sanctions on Russia. U.S., Ukrainian, and Russian officials are scheduled to hold trilateral peace talks in Geneva on Tuesday and Wednesday.\n\n**Iran-U.S. Meeting Scheduled**\nReports indicate that U.S. and Iranian officials will meet in Geneva this Tuesday to explore possible diplomatic resolutions to the rising tensions between the two nations. White House special envoy Steve Witkoff and Jared Kushner will lead the U.S. delegation, while Iranian Foreign Minister Abbas Araghchi will spearhead Ir",
    "redirectionUrl": "https://thedispatch.com"
  }
]