[
  {
    "uid": "morning-dispatch-2026-02-26",
    "updateDate": "2026-02-26T13:02:36.304Z",
    "titleText": "The Dispatch - Morning Briefing",
    "mainText": "**Will AI Destroy the Economy?**\nIt's June 2028. Unemployment stands at 10.2 percent, the S&P; 500 has fallen 38 percent from its 2026 highs, and a negative feedback loop of white-collar layoffs, collapsing consumer spending, and aggressive AI adoption has hollowed out the American economy.  This scenario was detailed by Alap Shah and James van Geelen in an essay published Sunday by Citrini Research. The authors labeled their work a thought experiment—not a prediction—but Wall Street took it seriously, leading to significant declines in stocks such as DoorDash, Mastercard, and Visa following the essay's release. The market's reaction indicates that investors are concerned about the potential disruption caused by AI.  A recent National Bureau of Economic Research (NBER) working paper found about 70 percent of firms actively use AI, yet over 80 percent reported no impact on employment or productivity over the past three years. Firms predict that technology will boost productivity by 1.4 percent while shrinking employment by 0.7 percent in the next three years.   AI's ability to facilitate easier coding is changing the landscape. Entrepreneurs can utilize platforms like Claude Code or Codex, potentially impacting companies reliant on software sales.  For example, in the Citrini essay scenario, DoorDash and Uber Eats could face competition from individuals coding their competing platforms at lower fees. At market close following the essay's publication, DoorDash's stock dropped from $176.60 to $164.50.  Additionally, experts raise concerns regarding automation leading to job displacement. Daron Acemoglu, an economics professor, argues that while productivity benefits from automation may arise, there is no guarantee that high-paying jobs will be created to replace those lost. However, technological innovations historically suggest that creation often outweighs destruction in economic shifts.  Recent developments show that while AI may replace certain roles, it also creates new opportunities. Some jobs, particularly in physical sectors, might benefit from increased productivity through better tools and supports.\n\n**Surgeon General Nominee Testifies on Vaccines**\nCasey Means, a nominee for Surgeon General and wellness influencer, testified before the Senate Health, Education, Labor, and Pensions Committee on her stances regarding vaccines and other health matters. During the testimony, she faced questions from lawmakers about her past statements. Despite stating that anti-vaccine sentiment was never part of her message, Means declined to rule out vaccines as a potential contributor to autism. This statement came despite overwhelming research indicating no link between vaccines and autism.\n**Greer Promises Increased Tariff Rates**\nU.S. Trade Representative Jamieson Greer stated that the baseline tariff on all imports to the U.S. would rise from 10 to 15 percent for some countries, with details still forthcoming. This comes after the Supreme Court's ruling impacting previous tariffs, and Greer plans to investigate unfair trade practices using Section 301 of the Trade Act. Economists estimate potential liability for the U.S. government could exceed $175 billion in tariff refunds.\n**Cuba Kills Four People on Speedboat**\nCuban authorities reported that four individuals were killed, and six others wounded, when border guards opened fire on a speedboat off Cuba's coast. Allegations suggest the boat's occupants were armed and involved in a potential terrorist infiltration. U.S. Secretary of State Marco Rubio announced an independent investigation by the Department of Homeland Security and Coast Guard, clarifying it was not a U.S. government operation.\n**Another Round of Iran Talks Begins**\nIranian negotiators are set to meet with U.S. envoys in Geneva today for discussions surrounding the Iranian nuclear program. The talks come amid heightened concerns over Iran's missile arsenal, which Iran insists will not be included in negotiations. Satellite imagery revealed U.S. F-22 fighter jets deployed at an Israeli air base, signaling heightened military presence ahead of the discussions.\n**Ukrainian Negotiations Resume**\nUkrainian officials will meet with U.S. envoys to discuss recovery frameworks and potential prisoner exchanges following their previous agreements. Russia’s recent drone attacks resulting in casualties",
    "redirectionUrl": "https://thedispatch.com"
  }
]