[
  {
    "uid": "morning-dispatch-2026-02-02",
    "updateDate": "2026-02-02T13:02:29.943Z",
    "titleText": "The Dispatch - Morning Briefing",
    "mainText": "**Can Markets Restrain Trump?**\n**Trump Chooses Fed Chair Nominee**\nPresident Donald Trump announced he would nominate Kevin Warsh to chair the Federal Reserve, replacing Jerome Powell whose term ends in May. Warsh previously served as an economic adviser in the Bush administration and was nominated by Bush to the Fed’s board of governors in 2006, becoming the youngest person to do so. In a Truth Social post, Trump expressed confidence in Warsh, stating, \"I have known Kevin for a long period of time, and have no doubt that he will go down as one of the GREAT Fed Chairmen, maybe the best.\"\nThe president described Warsh as a “very high-quality person” who should face little trouble in securing Senate confirmation, suggesting some Democratic senators might support him.\n**Responses from the Senate**\nRepublican Senator Thom Tillis from North Carolina stated he finds Warsh a qualified nominee with a deep understanding of monetary policy but will oppose any Fed nominee until the Justice Department’s inquiry into Powell is resolved. Powell’s term as chairman expires in May, but he may continue to serve on the Fed’s board until January 2028.\n**Federal Officials Arrest Don Lemon**\nFederal officials arrested nine individuals for disrupting a church service in Minnesota, among them former CNN anchor Don Lemon, who faces federal civil rights violations. Lemon and four other detainees were released after appearing in court, with Lemon's arraignment set for February 9. Additionally, Deputy Attorney General Todd Blanche announced a civil rights investigation into the fatal shooting of Alex Pretti in Minneapolis. Blanche described it as a standard FBI investigation rather than a massive civil rights probe.\n**Federal Action in Twin Cities**\nA federal district judge denied requests from Minneapolis and St. Paul for a temporary block against deploying an additional 3,000 federal agents to the area. The court found no evidence that the federal government's actions were unconstitutional. Another ruling ordered the release of an Ecuadorian national and his five-year-old son, who had been detained by immigration authorities.\n**DHS Funding Withheld**\nA partial federal government shutdown began on Saturday after the Senate approved a $1.2 trillion funding proposal for government agencies, excluding the Department of Homeland Security, which received only a two-week extension for further negotiation on immigration enforcement reforms. The House will review this package, with hopes for a vote on Tuesday.\n**Democrats Flip Texas Seats**\nDemocrat Taylor Rehmet secured 57 percent of the vote in a Texas state Senate special election, flipping a seat that Trump won in 2024 by 17 points. Rehmet defeated Trump-endorsed candidate Leigh Wambsganss. About 15 percent of registered voters participated, and Trump distanced himself from the loss, labeling it a local issue despite his prior endorsements.\n**Iran-U.S. Developments**\nAxios reported that the Trump administration expressed openness to negotiating with Iran through multiple channels. Trump mentioned during a flight on Air Force One that Iran was seriously engaging with U.S. officials. However, Supreme Leader Ali Khamenei warned that U.S. military action would lead to a regional war. Concurrently, Saudi Defense Minister Prince Khalid bin Salman warned against failing to act against Iran to avoid empowering its regime.\n**Economic Updates**\nThe producer price index rose 3 percent year-over-year as of December, up from November’s figures. United Arab Emirates national security adviser Tahnoun bin Zayed allegedly acquired a 49 percent stake in the Trump family's cryptocurrency business for $500 million last year. Additionally, the Trump administration announced the issuance of 64,716 H-2B seasonal worker visas due to start work between May and September.",
    "redirectionUrl": "https://thedispatch.com"
  }
]