[
  {
    "uid": "morning-dispatch-2026-01-23",
    "updateDate": "2026-01-23T13:00:14.881Z",
    "titleText": "The Dispatch - Morning Briefing",
    "mainText": "### Details of Greenland Deal Revealed\nMore information has emerged about the framework for a Greenland deal, which President Donald Trump claims he reached with NATO Secretary-General Mark Rutte. The deal reportedly designates parts of Greenland as \"sovereign base areas,\" modeled after the UK's arrangement with Cyprus regarding its military bases. This stipulation would enable the U.S. to conduct military and intelligence operations, station missiles—including components of Trump's proposed \"Golden Dome\" missile defense system—without requiring Danish permits.\n\n**Bloomberg** reports that the framework also includes mining rights aimed at restraining Chinese interests, a retooled version of a 1951 defense agreement, and an enhanced NATO presence in the Arctic. Rutte stated he did not discuss the sovereignty of the territory during his meeting with Trump, and Danish Prime Minister Mette Frederiksen emphasized that Rutte lacks the authority to negotiate on Denmark's behalf.\n- Frederiksen stated, \"We can negotiate on everything political; security, investments, economy. But we cannot negotiate on our sovereignty.\"\n- Trump, who before had insisted on complete U.S. control of Greenland, told Fox Business that the deal amounts to \"total access\" with \"no time limit,\" asserting, \"We’re getting everything we want at no cost.\"\n\n### Board of Peace Formally Signed Into Place\nPresident Trump formally signed the charter for his Gaza \"Board of Peace\" in Davos on Thursday, joined by leaders from 19 nations out of roughly 30 that the White House expects to accept. Notably, France and Britain have declined their invitations, while Russia has not yet committed.\n\nThe charter names Trump as the inaugural chairman of the board, separate from his responsibilities as the U.S. representative. For more information about the Board of Peace, refer to today’s article in **TMD**.\n\n### Trump Sues JPMorgan Chase\nOn Thursday, Trump filed a lawsuit against JPMorgan Chase and its CEO, Jamie Dimon, seeking at least $5 billion. He alleges that the bank discriminated against him by closing his accounts after the January 6 attack on the U.S. Capitol. The lawsuit claims that the bank's decision was politically motivated and that Dimon directed the decision to \"blacklist\" Trump and his companies.\n\nA spokesperson for JPMorgan Chase stated that accounts are closed not for political reasons but due to legal or regulatory risks.\n- While aboard Air Force One, Trump commented, \"You’re not allowed to do what they did. Jamie Dimon, what he did, he’s not allowed to do that.\"\n- JPMorgan Chase later responded that they regret the lawsuit but believe it lacks merit, affirming their right to defend themselves.\n\n### Ukraine Peace Talks in Abu Dhabi\nUkrainian President Volodymyr Zelensky announced that representatives from the U.S., Russia, and Ukraine will meet today and tomorrow in Abu Dhabi for technical talks. These will be the first such meetings of their kind. Zelensky stated that a deal on security guarantees for Ukraine has been finalized and a postwar reconstruction agreement is close, although the territorial issues remain unresolved. U.S. special envoy Steve Witkoff and Jared Kushner, Trump's son-in-law, went to Moscow for discussions with Russian President Vladimir Putin.\n- Kremlin aide Yuri Ushakov described the talks as \"substantive and constructive,\" but noted that without resolving the territorial issue, there is little hope for a long-term settlement.\n\n### Oscar Nominations Revealed\nDirector Ryan Coogler’s film *Sinners* has made history with 16 Oscar nominations, including Best Picture, Best Original Screenplay, Best Direction, and Best Actor for Michael B. Jordan’s portrayal.\n- *One Battle After Another*, directed by Paul Thomas Anderson, followed closely with 13 nominations and is viewed as a strong contender for Best Picture.\n- In foreign nomination categories, the Norwegian film *Sentimental Value* secured nine nominations, while Brazil's *The Secret Agent* gained four.\n- Notable snubs include Paul Mescal, who did not receive a Best Actor nomination for *Hamnet*, and Guillermo del Toro's absence from the Best Director nominations for *Frankenstein*.",
    "redirectionUrl": "https://thedispatch.com"
  }
]