[
  {
    "uid": "morning-dispatch-2026-02-15",
    "updateDate": "2026-02-15T13:01:25.824Z",
    "titleText": "The Dispatch - Morning Briefing",
    "mainText": "### End of ICE Surge in Minnesota\n\nLast week, border czar Tom Homan arrived in Minnesota to lead the Department of Homeland Security’s immigration enforcement operations, promising a reduced presence of federal agents in the state. On February 11, Homan announced that Operation Metro Surge was coming to an end, asserting that a significant reduction had already begun and would continue into the following week. He stated, \"Our efforts to address issues of concern here on the ground have yielded the successful results we came here for,\" referencing over 4,000 arrests.\n\nHowever, critics like Nick Catoggio pointed out that this figure is only marginally above the goal of 3,000 daily immigration arrests, as proposed by White House adviser Stephen Miller. With 3,000 agents deployed to Minnesota, this equates to merely one arrest for every 50 agents every day. Catoggio questioned the White House’s credibility regarding immigration enforcement, highlighting that the recent surge led to protests and tragic instances, including the shooting deaths of two U.S. citizens.\n\n### Impact on Trump’s Administration\n\nTrump’s approval ratings are at their lowest during his second term, with just 40% approving of his immigration policies. The repercussions of the increased immigration enforcement are expected to affect upcoming midterm elections, particularly the Democrats’ chances in the House and Senate. According to Jessica Taylor from the Cook Political Report, Democrats are in a better position now than they were a year ago, with potential paths to regain the Senate.\n\nThe recent turmoil also prompted a partial government shutdown, commencing on the same day as Homan's announcement. This shutdown follows a temporary funding agreement for the DHS and other agencies, wherein Democrats demanded immigration enforcement reforms as a condition for further funding support.\n\n### Sanctuary Policies\n\nThe situation in Minneapolis has intensified the discord between federal authorities and local governments with \"sanctuary\" policies, which vary widely but generally limit cooperation with federal immigration enforcement. Republican criticism has centered on how these policies contributed to chaos during the enforcement operations. They argue that operations could have been executed differently with fewer personnel and more focus on detaining individuals within jails rather than on the streets. This perspective has been contested by former DHS officials, including John Sandweg, who stated that Minneapolis' issues stemmed more from an increased federal presence and aggressive tactics against protestors than from sanctuary city policies.\n\n### Expert Opinions\n\nKevin D. Williamson highlighted the mixed reception of sanctuary policies. While he notes their unpopularity, he acknowledges their emergence as a response to the complexities of federalism and checks and balances in governance. Observers who previously criticized sanctuary policies are increasingly sympathetic due to the Trump administration's approach to immigration law enforcement.\n\nThis has led to a reevaluation of how federal immigration law might be enforced more effectively, suggesting that proper training and discretion could align more closely with local interests.\n\nOverall, Kevin’s recent trip to Minneapolis has provided valuable insights that highlight the need for a nuanced discourse on immigration enforcement versus the realities faced by affected communities.\n\n### Conclusion\n\nThe discussions surrounding the ICE surge in Minnesota reflect broader themes of governance, public safety, and the political landscape in America, particularly impacting both Republican and Democratic strategies moving toward the midterms.",
    "redirectionUrl": "https://thedispatch.com"
  }
]