[
  {
    "uid": "morning-dispatch-2026-02-07",
    "updateDate": "2026-02-07T13:00:15.291Z",
    "titleText": "The Dispatch - Morning Briefing",
    "mainText": "**Weekend Reads: Hydration, Humanities, and Film**\n**By Valerie Pavilonis, Susannah Black Roberts, and Charles Hilu**\nFebruary 7, 2026\n\nRegrettably, it’s still not any warmer on the East Coast. But whether you’re wearing one sweater or three, here are some intriguing reads for the weekend.\n\n**The American God of Water**\nThomas Dichter reflects on Americans’ obsession not just with water bottles, but with hydration itself, stating: \"Perhaps, in a time when we hear so much about impurities and contamination, the symbolic value of purity has power, and bottled water provides that.\"\n\n**Why I Don’t Regret Majoring in the Humanities**\nSharla Moody shares her experience of majoring in the humanities, emphasizing how reading John Milton's *Paradise Lost* gave questions about the problem of evil and existence of fate a significant force and meaning.\n\n**When a Christian World Loses Christ**\nMaggie Phillips discusses the new movie *28 Years Later: The Bone Temple*, highlighting how it depicts a Christianized culture divorced from its theological roots. She points out a character's struggle, noting, “He is operating within a 20th-century ethical framework that was shaped by Christian morality but that has jettisoned Christ.”\n\nIn related articles from earlier this week, Autumn Christian delves into how online ideologies hinder romantic love, Lisa Selin Davis discusses changes in medical organizations’ stances on pediatric gender transition, Jonny Gartner reflects on his experience at Kroger and the American Dream, and Greg Fournier marks the 75th anniversary of *God and Man at Yale*.\n\n**An Outside Read**\nThe Winter Olympics are underway in Italy. Recently, the *New York Times Magazine* featured a remarkable piece on American cross-country skier Jessie Diggins. It describes her intense athleticism and a dramatic moment when she collapsed after racing to a silver medal, stating: \"When Diggins crossed the finish line in 1 hour, 26 minutes, 37.3 seconds—nearly a minute ahead of the bronze medalist—she collapsed, skis split akimbo, face in the snow.\"\n\n**Stuff We Like**\nCharles Hilu shares a personal story about discovering the gaming phenomenon *Five Nights at Freddy’s* while bowling with friends before eighth grade. He reflects on how the game captivated fans, thanks to its intricate story about animatronics and the dark history behind them, leading to a loyal community hungry for narrative resolution even years later.\n\n**Work of the Week**\nThis week's featured artwork is *Two Men Contemplating the Moon* by Caspar David Friedrich, dating back to around 1825. Brandon Goldman, a member of The Dispatch, expresses that this piece invites contemplation of a world vastly different from modern life while showcasing an intimate friendship. He suggests that such moments of reflection are often overshadowed by modern distractions like social media.",
    "redirectionUrl": "https://thedispatch.com"
  }
]