[
  {
    "uid": "morning-dispatch-2026-01-27",
    "updateDate": "2026-01-27T13:00:19.276Z",
    "titleText": "The Dispatch - Morning Briefing",
    "mainText": "**The Fatal Shooting of Alex Pretti, and the Aftermath**\nThe White House is reshaping the Department of Homeland Security in response to the tragic shooting and killing of Alex Pretti, a thirty-seven-year-old intensive care nurse, by federal agents in Minneapolis. Following the incident on January 25, 2026, it was reported that Border Patrol commander-at-large Gregory Bovino will be reassigned from Minnesota back to El Centro, California, and has been locked out of his social media accounts. Tom Homan, the border czar, is set to oversee federal operations in Minneapolis, reporting directly to President Trump. Trump characterized his conversation with Minnesota’s Democratic Governor Tim Walz as \"very good\" and mentioned progress in addressing the aftermath of the shooting.\n\nCourt filings indicate that the investigation into Pretti's death is classified as a “use of force” review, with no criminal inquiry mentioned. Meanwhile, Homeland Security stated that some agents wore body cameras during the incident, and they are preserving the footage for review.\n\nIn the wake of the shooting, a federal district judge has ordered the Department of Homeland Security to respond to claims by Minnesota officials that the immigration enforcement actions were meant to retaliate against the state government for opposing Trump’s policies.\n\n**Israel Recovers Final Hostage Body**\nThe Israel Defense Forces announced the recovery of the body of Staff Sgt. Maj. Ran Gvili, the final Israeli hostage from the October 7 Hamas attack. Gvili’s body was located in eastern Gaza City during search operations. He had previously died defending civilians during the attacks in early October. His remains were returned to Israel and a funeral is scheduled for Wednesday. With Gvili’s return, no Israeli hostages remain in Gaza for the first time since 2014.\n\nPrime Minister Benjamin Netanyahu's office suggested plans for a limited reopening of the Rafah crossing between Egypt and Gaza, coordinating security measures with U.S. and Egyptian officials following Gvili’s return. In a recent interview, President Trump credited Hamas for assisting in locating Gvili’s remains.\n\n**U.S.S. Abraham Lincoln Is Near Iran**\nThe U.S.S. Abraham Lincoln and its strike group have arrived in the Middle East, with the objective of promoting regional security and stability. President Trump commented during an interview that there is significant military movement close to Iran, although he did not indicate plans for military action at this moment. Reports suggest communications between Iranian officials and U.S. representatives are ongoing, though they have not advanced to formal negotiations.\n\n**Burma's Dubious Election Results**\nThe military government of Burma claimed victory in recent elections despite significant limitations, including absent major opposition candidates and restricted voting sites. The military still retains a guaranteed 25 percent of legislative seats, and as a result, anti-government rebel forces control about 40 percent of the country but have unfilled seats in those areas.\n\n**Ukraine Negotiations Continue**\nKremlin spokesman Dmitry Peskov confirmed that U.S., Ukrainian, and Russian officials will convene next week in Abu Dhabi to discuss ongoing peace negotiations. He noted that while substantial progress is needed, the talks are considered a positive step forward as President Zelensky of Ukraine remains ready for future discussions.",
    "redirectionUrl": "https://thedispatch.com"
  }
]