[
  {
    "uid": "morning-dispatch-2026-02-23",
    "updateDate": "2026-02-23T13:03:04.757Z",
    "titleText": "The Dispatch - Morning Briefing",
    "mainText": "**Supreme Court Strikes Down Trump’s Tariffs**\nIn a six to three decision on Friday, the Supreme Court ruled that President Donald Trump exceeded his authority by imposing tariffs under the 1977 International Emergency Economic Powers Act, known as IEEPA. Chief Justice John Roberts authored the majority opinion, which was joined by three liberal justices and Justices Amy Coney Barrett and Neil Gorsuch. Justice Brett Kavanaugh dissented, arguing that the IEEPA granted clear authority for the executive to impose tariffs, while Justices Samuel Alito and Clarence Thomas joined his dissent.\n\nThe ruling strikes down a significant portion of the Trump administration's tariffs. It was determined that the Court would not rule on how to issue refunds for the duties already collected. In response to the ruling, Trump labeled the dissenting justices as a \"disgrace to our nation\" and claimed they were not acting patriotically. He announced a new 10 percent global tariff that was quickly raised to 15 percent, effective immediately, which will remain in effect for 150 days unless extended by Congress.\n\n**U.S. Intel Assists In Mexico Cartel Operation**\nOn Sunday, U.S. and Mexican officials confirmed that a military operation led by Mexico, with support from U.S. intelligence, successfully killed the notorious cartel leader Nemesio Rubén Oseguera Cervantes, known as \"El Mencho,\" head of the Jalisco New Generation Cartel. The confrontation occurred in southern Jalisco, resulting in Oseguera’s death after sustaining injuries during a firefight. Three soldiers were wounded in the incident, and two other cartel members were captured. Following this operation, the U.S. Embassy in Mexico issued a warning for Americans in five states to shelter in place due to widespread unrest, as CJNG affiliates retaliated by burning vehicles to block roads in around 20 states.\n\n**New Economic Data**\nThe Bureau of Economic Analysis released a report stating that the personal consumption expenditures price index, which is the Federal Reserve's preferred inflation metric, rose by 0.4 percent in December 2025. The annual inflation rate reached 2.9 percent, an increase of 0.1 percent compared to November. The core PCE, which excludes food and energy, also increased by the same margin, hitting an annual rise of 3.0 percent. Additionally, the U.S. GDP growth for the fourth quarter of 2025 was reported at an annualized rate of 1.4 percent, significantly lower than the expected 2.5 percent.\n\nTrump attributed the weak economic growth to the government shutdown, which he faulted on Democrats, and criticized Federal Reserve Chairman Jerome Powell, suggesting he should lower interest rates.\n\n**ISIS Suspects Escape in Syria**\nReports from the Wall Street Journal confirmed that a majority of detainees at the Al-Hol camp, including suspected ISIS militants, escaped during a security lapse when Syrian Democratic Forces pulled out and government reinforcements had not yet secured the area. U.S. officials estimate that between 15,000 and 20,000 individuals, including Jihadist fighters and their families, are now at large. This mismanagement has been blamed for the escape, with violence subsequently erupting across Mexico, resulting in CJNG affiliates blocking roads with burning vehicles.\n\n**Armed Man Shot and Killed at Mar-a-Lago**\nAn armed 21-year-old man from North Carolina was shot and killed by security at Donald Trump's Mar-a-Lago estate after he breached the perimeter near the north gate. At the time, Trump was in Washington, D.C. After officers ordered the suspect to drop his weapon, he instead aimed his shotgun, prompting security personnel, including one deputy and two Secret Service agents, to open fire, fatally wounding him. There were no injuries sustained by law enforcement personnel during the occurrence.\n\nThese significant developments highlight ongoing tensions both politically and socially within the United States and its international relations.",
    "redirectionUrl": "https://thedispatch.com"
  }
]