[
  {
    "uid": "morning-dispatch-2026-02-18",
    "updateDate": "2026-02-18T13:02:15.898Z",
    "titleText": "The Dispatch - Morning Briefing",
    "mainText": "**America’s Shipbuilding Revival**\n\nSouth Philadelphia’s shipyards date back to 1776, reflecting the early maritime industry of the young United States. The Philadelphia Naval Shipyard constructed its first wooden ship, the USS Franklin, in 1815 and thrived well into the 20th century, employing 40,000 workers during World War II. However, the yard built its last new ship, the USS Blue Ridge, in 1970 and halted operations in 1996 as the Cold War ended and military spending decreased. Restarted in 2000 as a commercial venture, the facilities have since been acquired by the South Korean Hanwha Group in 2024.\n\nCurrently, the shipyard is at the forefront of the U.S. initiative to revitalize its ailing commercial shipbuilding sector. Following President Donald Trump’s executive order to \"Restore American Maritime Dominance\" in April of last year, Hanwha announced a $5 billion investment in August. The recently unveiled Maritime Action Plan aims to stimulate the construction of large merchant vessels and to create a maritime industrial base in the U.S.\n\nDespite being the largest economy globally, the U.S. produced just 0.04% of the world’s new merchant ships in 2024, with a substantial portion of its maritime trade dependent on foreign-flagged vessels. The proposal also emphasizes the need for an expanded capacity to carry military goods effectively in times of conflict.\n\nOfficials noted the challenges ahead, with U.S. shipyards currently handling few orders, producing large ships at higher costs compared to their Asian counterparts. For example, the Hanwha Philly Shipyard is building Aloha Class freighters for $330 million each, while similar vessels in Asia cost about $75 million. To address these disparities, it will be crucial to institute policy changes and develop market demand to build a sustainable shipping industry.\n\n**Peru Removes Acting President**\nPeru's legislature voted 75-24 with three abstentions to oust acting President José Jerí, over undisclosed meetings with Yang Zhihua, a Chinese businessman holding a state energy concession. Videos surfaced showing Jerí in questionable situations, including not logging his mandatory official meetings. This vote of no confidence comes only four months after his interim appointment. Today's Congress will select a new interim president until elections in April. This marks Peru's third consecutive presidential removal and the fourth since 2018.\n\n**U.S.-Iran Talks Continue**\nU.S. and Iranian officials met in Geneva to discuss Iran’s nuclear program, noting some progress. Vice President J.D. Vance said Iranians agreed to another meeting but indicated red lines from the U.S. remain unacknowledged. Iran is expected to provide more detailed proposals in two weeks. Iranian Foreign Minister Abbas Araghchi labeled the discussions as constructive. However, concerns are raised about possible U.S. military action against Iran following assessments of ongoing tensions in the region.\n\n**U.S.-Ukraine-Russia Talks Continue**\nNegotiations involving American, Ukrainian, and Russian officials in Geneva failed to yield any breakthroughs after one day. President Volodymyr Zelensky stated that Russia is expected to present their views on territorial negotiations and readiness for compromises. Furthermore, Russian military actions have escalated recently, with overnight attacks reported across multiple Ukrainian regions.\n\n**Warner Bros. Reopens Paramount Acquisition Talks**\nWarner Bros. Discovery has announced a seven-day reopening of acquisition talks with Paramount Skydance to resolve deficiencies in Paramount’s offer. Netflix agreed to allow this period as WBD clarifies its options. This comes after Paramount sweetened its offer amid ongoing negotiations following a previously announced deal for the streaming service to acquire the famed studio.\n\n**Board of Peace Talks With Hamas**\nThe Board of Peace, led by a Trump representative, has engaged in direct discussions with Hamas regarding disarmament. Meetings are set to finalize a demilitarization plan, which may allow Hamas to retain some arms. This follows prior arrangements with Hamas primarily through intermediaries. The Board’s goals include determining Gaza's military future and facilitating reconstruction efforts.\n\n**On the Money**\nCommodity Futures Trading Commission Chairman Michael Selig has voiced support for platforms lik",
    "redirectionUrl": "https://thedispatch.com"
  }
]