[
  {
    "uid": "morning-dispatch-2026-01-29",
    "updateDate": "2026-01-29T13:02:20.904Z",
    "titleText": "The Dispatch - Morning Briefing",
    "mainText": "**Will DHS Funding Cause a Shutdown?**\n\n**FBI Executes Search on Georgia Election Office**\nThe FBI on Wednesday searched an election facility in Fulton County, Georgia, which an FBI spokeswoman indicated is related to an ongoing federal investigation. The purpose of the investigation remains undisclosed, but the FBI confirmed that their actions were court-authorized and that they secured a search warrant. Fulton County officials reported that the warrant allowed federal agents to seize records associated with the 2020 elections. Democratic Fulton County Commissioner Mo Ivory stated that the FBI did not present a physical copy of the warrant initially and that, by Wednesday afternoon, no documents had been removed from the facility. The FBI has partially contested that assertion, claiming a physical warrant was shown but the operation was still active.\n\n- In mid-December, the Justice Department filed a lawsuit against Fulton County’s clerk of courts for access to various election documents related to the 2020 presidential election.\n- Recently, President Donald Trump reiterated at the World Economic Forum that the 2020 presidential election was “rigged,” asserting that those responsible would soon face prosecution.\n\n**Federal Agents in Minnesota Placed on Leave**\nAt least two federal agents involved in the recent fatal shooting of 37-year-old protester Alex Pretti in Minneapolis have been placed on administrative leave. According to sources, this action is part of standard procedure and not a disciplinary action. Senate Minority Leader Chuck Schumer unveiled a set of demands for changes to the Department of Homeland Security that must be included in a federal funding bill, which includes body camera mandates and restrictions on warrant usage. A report by the DHS indicated that two officers fired their weapons during the incident.\n\n- After Democratic Mayor Jacob Frey stated that Minneapolis will not enforce federal immigration laws, Trump reacted, labeling Frey’s comments as a violation of law.\n- White House deputy chief of staff Stephen Miller commented on the potential violations of DHS protocol in the operation by Customs and Border Protection in Minnesota.\n\n**Federal Reserve Leaves Rates Unchanged**\nFollowing a two-day meeting, the Federal Reserve maintained interest rates at a target range of 3.5 to 3.75 percent in a 10-2 vote. Federal Reserve Chairman Jerome Powell stated that the data will guide monetary policy, emphasizing the economy's positive trajectory since the previous meeting. Both Powell and the Federal Reserve Open Market Committee acknowledged that the economy is growing at a steady pace.\n\n- Powell did not address the ongoing investigation and congressional subpoena but defended the Fed’s independence.\n- When questioned about the recent legal challenges concerning Federal Reserve Governor Lisa Cook, Powell remarked that the case is among the most significant in the Fed's history.\n\n**Zelensky Warns of Impending ‘New Massive Strike’ From Russia**\nUkrainian President Volodymyr Zelensky warned that intelligence indicates Russia is preparing for a significant military strike against Ukraine. He urged U.S. and European allies to acknowledge the implications such actions have on diplomatic conversations. Zelensky highlighted overnight airstrikes in Ukrainian cities, resulting in casualties, including children. The strikes targeted residential areas, worsening the ongoing crisis.\n\n- Analysts suggested that Shahed drones possibly influenced a recent Russian drone attack that resulted in civilian casualties.\n- Ukraine also summoned Hungary’s ambassador following accusations from Hungary’s Prime Minister that Ukraine attempted to meddle in Hungary’s upcoming elections.\n\n**Rubio Testifies Before Senate Committee**\nSecretary of State Marco Rubio testified before the Senate Foreign Relations Committee regarding U.S. involvement in Venezuela. Although he affirmed that no immediate military actions are planned, Rubio did highlight the administration’s commitment to ensure compliance from the Venezuelan government concerning oil sales. He reiterated that the U.S. aims to reopen its embassy in Venezuela soon. Rubio expressed skepticism regarding the Venezuelan government’s ability to conduct fair elections under current conditions.\n\n**Today in America**\n- Indiana police suspect a motorcycle gang is behind a re",
    "redirectionUrl": "https://thedispatch.com"
  }
]