[
  {
    "uid": "morning-dispatch-2026-01-18",
    "updateDate": "2026-01-18T13:00:55.632Z",
    "titleText": "The Dispatch - Morning Briefing",
    "mainText": "**Federal Reserve Chair Jerome Powell Responds to Investigation**\n\nFederal Reserve Chairman Jerome Powell, nominated by President Donald Trump in 2017, has faced continued criticism from Trump throughout his second term. Trump has labeled Powell “incompetent,” a “numbskull,” and a “moron,” and has even threatened to fire him—a move he is legally unable to make—due to Powell’s and the Federal Reserve’s resistance to pressure for lowering interest rates.\n\nDuring Trump’s second term, many targets of his ire have buckled under pressure, with various media outlets and universities settling lawsuits with Trump and changing policies for federal research grants. Law firms have also reached settlements to avoid penalties connected to individuals Trump disapproved of.\n\nIn stark contrast, Powell has chosen to stand his ground. On Sunday evening, he issued a short video statement revealing that the Justice Department had subpoenaed the Federal Reserve and was threatening to indict him for allegedly lying to Congress about the renovations at the Federal Reserve headquarters. Powell interpreted the subpoena as a pretext for political pressure, asserting:\n\n\"The threat of criminal charges is a consequence of the Federal Reserve setting interest rates based on our best assessment of what will serve the public, rather than following the preferences of the president. This situation raises the question of whether the Fed will be able to continue to set interest rates based on sound evidence and economic conditions or if monetary policy will be dictated by political pressure or intimidation.”\n\nNick Catoggio, in his piece \"Boiling Frogs,\" discusses why Powell is uniquely positioned to speak out against these pressures. He notes:\n\n“Powell likely understands that he represents one of the last strongholds within the American government against Trump’s attempts to undermine it. As the head of the Federal Reserve—an agency that is meant to be quasi-independent—he is not easily swayed by the political tides and is not governed by the same pressures faced by elected officials.”\n\nPowell’s recent statement appears to have drawn support from within the political sphere. Republican Senator Thom Tillis, a member of the Senate Banking Committee, has stated he will block all nominees to the Federal Reserve Board until the legal issues surrounding Powell are completely resolved. Additionally, Treasury Secretary Scott Bessent reportedly expressed concern to Trump that the investigation launched by U.S. Attorney Jeanine Pirro in November had created significant chaos.\n\nJohn McCormack, detailing the responses from lawmakers, highlights that both Republicans and Jason Furman, former chair of the Council of Economic Advisers under Barack Obama, praised Powell and his response.\n\nPowell’s careful choice of words during this crisis has been noted as significant. By directly addressing the investigation as politically motivated, he seeks to stabilize the financial markets and reduce potential fallout.\n\nThe investigation echoes previous attempts by the Trump administration to remove officials who have crossed the president. In August, Trump attempted to dismiss Federal Reserve Governor Lisa Cook over accusations of mortgage fraud but was blocked by a federal judge. Similar pressures have also targeted New York Attorney General Letitia James, where despite an indictment, her case was ultimately dismissed.\n\nFederal Housing Finance Agency Director Bill Pulte, described as a major force behind Trump’s pressure campaigns against Powell, has repeatedly sensationalized Powell’s decisions to influence public opinion. His rhetoric accused Powell of impeding economic progress due to his personal wealth, branding him as “the worst Chairman of the Federal Reserve in history.”\n\nFinally, Pulte notably pushed for Trump to fire Powell and has spread unsubstantiated claims concerning fraud linked to the extensive renovations of the Fed’s headquarters.\n\nAs the political landscape continues to shift, Powell’s decisive stand may illustrate a crucial moment of resistance against potential political coercion in monetary policy.",
    "redirectionUrl": "https://thedispatch.com"
  }
]